[
    {
        "script_text": "Happy Solar Return, Aries. The Sun is illuminating your 10th House of Career and Legacy. This year, the spotlight isn't just on your ambition; it's on your impact. You are stepping into a year of public recognition and professional definition. While others may feel stuck in the fog of 2026's uncertain energies, your Ascendant energy cuts through the chaos with decisive, leadership-oriented fire. You aren't just playing a role; you are building an empire. The main growth area is undeniably Self—specifically your reputation and worldly standing. The universe is asking: How do you wish to be remembered? The answer lies in the actions you take now.",
        "title": "Aries Solar Return 2026: Ascendant Energy Analysis",
        "target": "Aries",
        "type": "birthday",
        "date": "Jan 16",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": true,
        "youtube_title": "Aries: Your 2026 Career Explodes! 🔥 #shorts",
        "youtube_description": "Aries, your Solar Return reveals a massive shift in your career and legacy for 2026. Are you ready for this level of public recognition?\n\nWhat major professional goal are you setting this year? Let me know in the comments! #Aries #SolarReturn #CareerGrowth #Astrology",
        "youtube_tags": [
            "Aries 2026",
            "Aries Solar Return",
            "Aries Career 2026",
            "Aries Horoscope 2026",
            "Astrology Predictions",
            "Solar Return Chart",
            "10th House Astrology",
            "Manifestation 2026",
            "Zodiac Signs",
            "Aries Rising",
            "Career Astrology",
            "Year Ahead Reading",
            "Aries Energy",
            "Astrology Shorts",
            "Trending Astrology",
            "Personal Growth",
            "Yearly Forecast",
            "Aries Ambition",
            "shorts",
            "viral",
            "astrology",
            "aries"
        ]
    },
    {
        "script_text": "Happy Solar Return, Taurus! The cosmos lights up your chart, and the Ascendant is your spiritual mask for the year. Today, your Solar Return Sun illuminates the **9th House**, the realm of wisdom and higher horizons. This is a year where you are not just sitting back; you are expanding. The Ascendant energy is restless and intellectual, pushing you beyond the familiar fields of your sun sign. Your main growth area is undeniably **Self**. While relationships and wealth fluctuate, your internal philosophy is transforming. You are being called to trust your intuition and see the bigger picture. Expect a magnetic pull toward travel, study, or spiritual truth. This isn't just about comfort; it's about evolution. Who are you becoming? Look to the horizon, Taurus, and step into the unknown.",
        "title": "Taurus SR 2026 Ascendant Deep Dive",
        "target": "Taurus",
        "type": "birthday",
        "date": "Jan 16",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": true,
        "youtube_title": "TAURUS 🐂 Your 2026 Predictions Reveal This SECRET 😱 #shorts",
        "youtube_description": "Is your ASCENDANT changing your destiny this year, Taurus? 💫 With the Sun in your 9th House, the focus is on personal evolution. What truth are you ready to explore?\n\n#Taurus #SolarReturn #AstrologyReadings",
        "youtube_tags": [
            "Taurus",
            "Astrology",
            "Solar Return",
            "2026 Predictions",
            "Taurus 2026",
            "Ascendant",
            "Horoscope",
            "Manifestation",
            "Spiritual Awakening",
            "9th House",
            "Growth Mindset",
            "Self Love",
            "TikTok Astrology",
            "Viral Shorts",
            "Mystical",
            "Zodiac Signs",
            "Birthday Reading",
            "Taurus Rising",
            "Personal Evolution",
            "shorts",
            "viral",
            "astrology",
            "taurus"
        ]
    }
]