[
    {
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, even the bravest warriors need to lay down their shields. With the Moon fading into the darkness before tomorrow’s New Moon, you might feel a sudden drop in your usual fire. Please don't mistake this for a loss of momentum. You are simply being asked to recharge. Let go of the need to be 'productive' for just one day. Your only job today is to breathe and let the week’s stress fall away. You’re coming home to yourself."
    },
    {
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, I know you’ve been carrying heavy thoughts about your future lately. Today, the universe is inviting you to set those bags down. You don’t need to have the next five years figured out by tonight. Find comfort in the small things—the warmth of a blanket or the silence of a quiet room. You are safe, and you are doing enough. Allow your mind to rest so that your heart can begin to dream again. Tomorrow is a new start."
    },
    {
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, the mental chatter might feel a bit louder today as we approach the New Moon. If you’re feeling a little overwhelmed by your own thoughts, I want you to know it’s okay to unplug. You don't have to respond to every message or solve every puzzle today. Give your beautiful mind a break from the noise. In the silence, you’ll find the clarity you’ve been seeking. Trust that the answers will find you when you stop chasing them so hard."
    },
    {
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, you are so good at taking care of the world, but today the world needs to wait. Your heart is feeling extra tender as the lunar cycle ends. It’s okay to pull back into your shell and prioritize your own peace. You aren't being selfish; you are being sustainable. Wrap yourself in the same kindness you give to others so freely. Let go of any guilt you’re carrying. You are loved for who you are, not just for what you do."
    },
    {
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, I know it’s hard for you to be still when you feel you should be shining. But even the stars are hidden during the dark of the Moon. Today is your permission slip to be 'off-duty.' You don't have to perform or be the source of strength for everyone else. Honor your tiredness. There is a deep, quiet power in resting your spirit. By allowing yourself to recharge today, you ensure your light will be brighter than ever tomorrow. Be gentle with yourself."
    },
    {
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, that list of things you haven't finished? It can wait. Your inner critic might be whispering that you’re falling behind, but I’m here to tell you that rest is a vital part of your work. Today is for clearing the emotional clutter. Forgive yourself for not being perfect. You have done so much this week, and your soul needs a moment to catch up. Focus on what makes you feel peaceful, not what makes you feel productive. You’ve earned this quiet."
    },
    {
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, you often find your balance by adjusting to others, but today I want you to find balance within yourself. If the world feels a bit too loud or demanding, it’s okay to retreat to your sanctuary. You don’t have to keep the peace for everyone else today. Let go of the need to please. In the stillness of your own company, you’ll find the equilibrium you’ve been searching for. Your peace is worth protecting. Just be, and let that be enough."
    },
    {
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, you are comfortable in the shadows, but today the shadows might feel a little heavier than usual. You’re processing deep emotions and preparing for a personal reset. If you feel more introverted, honor that need for privacy. You are doing the quiet work of releasing old hurts and outdated patterns. You don't need to explain your process to anyone. Trust your internal transformation. You are becoming a lighter version of yourself with every breath you take. Stay soft today."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, your arrow can’t always be in flight. Today, the universe is asking you to lower your bow and rest your gaze. The focus on responsibilities has been intense, and it’s okay if you feel a little drained. Think of today as a spiritual pit stop. You aren't losing time; you are gathering the strength for your next big adventure. Take a moment to appreciate how far you’ve come. Your future is bright, but your present deserves some quiet care, too."
    },
    {
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, as the Moon fades in your sign, you might feel the weight of your crown more than usual. You’ve been the pillar of strength for so long. Today, I want you to remember that it’s okay to be human. You don't have to carry every burden alone. Tomorrow is your New Moon—your fresh start—but today is for letting go of the old armor. Give yourself permission to feel, to rest, and to just exist. You are valued for your heart, not just your hustle."
    },
    {
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, you’re often living in the future, but today the stars are pulling you back into the quiet of the present. Your intuition is very active right now, whispering truths you might have been too busy to hear. Honor your need for solitude. You aren't being distant; you are simply recalibrating your soul. Trust the shifts happening in the background of your life. You are preparing for a massive breakthrough, but for today, the most revolutionary thing you can do is rest."
    },
    {
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, you are the most sensitive soul in the zodiac, and today the energy of the world might feel a little overwhelming. If you feel like you’re carrying everyone else’s emotions, please take a moment to ground yourself. Visualize yourself letting go of what isn't yours to carry. You need your energy for your own dreams. Seek out the comfort of water or music, and let it wash away the week’s heaviness. You are safe, you are protected, and you are deeply loved."
    }
]
