[
    {
        "script_text": "Unleash the Firestorm: Aries vs Leo Synastry! These pairs are born to collide—two ruling fiery archetypes! Whether Venus struggles with Mars or Mars sparks a fierce Sun-Moon dance, their compatibility is legendary (or explosive, depending on alignment). Fire over Fire brings intensity, confidence, and raw honesty. But watch for Venus/Mars clashes—both strong-hearted, but each has a different passion flame. Will they embrace inner fire or risk a volcano of friction? Compatibility's not just about compatibility—it's about transformation and leadership. Tune in to screaming horoscope truth!",
        "title": "Aries & Leo Synastry Fire Clash! Compatibility Deep Dive",
        "target": "Aries vs Leo",
        "type": "compatibility",
        "images": [
            "assets/zodiac_signs/Aries.jpg",
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "pending",
        "uploaded": false,
        "youtube_title": "Aries vs Leo Synastry: Will Your Fire Burn Bright or Explode? #shorts",
        "youtube_description": "Are Aries and Leos compatible fiery disaster or cosmic forces in balance? Get brutally honest answers on Sun/Moon, Venus/Mars, and elemental clash. Are you ruled by fire? Will your passion burn or blaze out of control?",
        "youtube_tags": [
            "#Aries",
            "#Leo",
            "#Synastry",
            "#Astrology",
            "#Zodiac",
            "#FireSigns",
            "#Compatibility",
            "#RelationshipAstrology",
            "#FireOverFire",
            "#AriesVsLeo",
            "#AriesAndLeo",
            "#Horoscope",
            "#YouTubeAstrology",
            "#AriesShorts",
            "#LeoShorts"
        ],
        "date": "Jan 16"
    },
    {
        "script_text": "Are Taurus & Virgo destined to clash or connect on a deep soul level? While Taurus brings water, Virgo is drenched in fire. Fixed Taurus vs Analytical Virgo—how does Venus’ longing meet Mars’ restless drive? You’re too stubborn to yield, they’re too critical to let go. Listen, their Sun/Moon interplay is explosive—his grounded need for love, her boundless curiosity. It’s passionate but bruising. The fire burns bright but Taurus keeps the flame smothered… until Virgo’s emotionally honest, grounding him in more ways than one. Will their elemental struggle spark love or disaster? Watch, subscribe.",
        "title": "Taurus vs Virgo: Soul Fire Clash Revealed",
        "target": "Taurus vs Virgo",
        "type": "compatibility",
        "images": [
            "assets/zodiac_signs/Taurus.jpg",
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "youtube_title": "Taurus Virgo Cosmic Combat #shorts",
        "youtube_description": "Can Earth meet Air?-earthmeetair. Taurus & Virgo’s tug-of-war could be your destiny. What makes them soulmates or soul-killers? Comment your favorite pairing and hit like for more! #astrology #Taurus Virgo #relationship advice #SunVenusMars",
        "youtube_tags": [
            "#astrology",
            "#Taurus vs Virgo",
            "#love compatibility",
            "#sunvenusmars",
            "#astrology short",
            "#Taurus",
            "#Virgo",
            "#relationship",
            "#fixearth",
            "#airsign",
            "#water",
            "#fire",
            "#compatibility",
            "#spirituality",
            "#manifestation",
            "#zodiac signs",
            "#Taurus Virgo relationship",
            "#Taurus Virgo love",
            "#zodiac conflicts",
            "#zodiac compatibility",
            "shorts",
            "viral",
            "astrology",
            "taurus vs virgo"
        ],
        "date": "Jan 16"
    }
]