[
    {
        "title": "Aries Daily Horoscope ♈ - January 30, 2026",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, your spark is officially back! As the Moon moves into fellow fire sign Leo, your sector of joy, romance, and creativity is lit up. After yesterday’s emotional heavy lifting, today feels like a celebration. Follow your heart toward whatever makes you feel most alive. Whether it’s a creative project or a bold romantic move, don't hold back. You are a natural leader of fun—show us how it’s done. Your vitality is your greatest gift today."
    },
    {
        "title": "Taurus Daily Horoscope ♉ - January 30, 2026",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, the Leo Moon is shining a warm light on your home and sanctuary today. You might feel a sudden urge to decorate, host a gathering, or simply take pride in your private world. I know you value stability, but today is about adding a little 'flair' to your foundation. Treat your living space like the kingdom it is. A moment of heartfelt connection with a family member can heal old wounds. You are the heart of your home; let that light shine inward."
    },
    {
        "title": "Gemini Daily Horoscope ♊ - January 30, 2026",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, your words are infused with passion and authority today! As the Moon enters Leo, your communication sector becomes a stage. People aren't just listening to what you say; they are feeling how you say it. Use this 'heart-fire' to advocate for an idea you believe in or to tell someone exactly how much they mean to you. Your wit is sharp, but your warmth is what will win people over. Speak from the center of your chest. The world is your audience."
    },
    {
        "title": "Cancer Daily Horoscope ♋ - January 30, 2026",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, you’ve emerged from the deep waters of yesterday with a new sense of self-worth. As the Moon moves into Leo, you are realizing that your sensitivity is a high-value asset. It’s a great day to look at your finances or your resources with a sense of pride rather than fear. You are worth the abundance you seek. Treat yourself to something that makes you feel 'royal' today, even if it’s small. You’ve done the hard work—now enjoy the reward."
    },
    {
        "title": "Leo Daily Horoscope ♌ - January 30, 2026",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, the Moon has returned to your sign, and the world feels right again! This is your personal 'recharge' day. After a month of focusing on others, the universe is giving you permission to focus entirely on you. Your magnetism is at an all-time high. Trust your instincts and wear your heart on your sleeve. You don't need to do anything special to be noticed; your natural radiance is enough. Step into your power and lead with love. We’ve missed your light!"
    },
    {
        "title": "Virgo Daily Horoscope ♍ - January 30, 2026",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, while the rest of the world is getting loud, you are finding a powerful courage in the silence. The Leo Moon is moving through your house of the subconscious, helping you face your inner world with a brave heart. You are realizing that your greatest strength is found in your spiritual resilience. Don't be afraid to take some 'me time' to process recent shifts. You are preparing for a major debut soon. For today, let your inner light be your guide. You are safe and supported."
    },
    {
        "title": "Libra Daily Horoscope ♎ - January 30, 2026",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, your social life is getting a massive boost of warmth and drama—the good kind! The Leo Moon is energizing your friendships and your dreams for the future. You are the 'glue' that holds your tribe together today. Use your natural charm to bring people together for a common cause. Your ability to see the best in others is inspiring them to be their best selves. Don't be afraid to take the lead in a group setting. Your vision is exactly what everyone needs to hear."
    },
    {
        "title": "Scorpio Daily Horoscope ♏ - January 30, 2026",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, the spotlight is shining directly on your career and your public image today. After a few days of internal processing, it’s time to show the world what you’ve been building. The Leo Moon gives you the 'star power' to make a lasting impression on those in authority. Don't be modest about your accomplishments today. You have worked hard for this expertise—own it. Your professional path is opening up because you are finally brave enough to be seen. Stand tall."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐ - January 30, 2026",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, your spirit is expanding with a new sense of adventure today! With the Moon in fellow fire sign Leo, your thirst for wisdom and travel is being stoked. If you’ve felt a bit restricted lately, today provides the breakthrough you’ve been waiting for. Whether it’s a new philosophy or a literal trip, follow the call of the horizon. You are remembering that life is a grand story, and you are the hero. Share your optimism with someone who feels stuck. Your fire is contagious."
    },
    {
        "title": "Capricorn Daily Horoscope ♑ - January 30, 2026",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, today’s energy is deep, passionate, and incredibly transformative. The Leo Moon is lighting up your house of intimacy and shared power. After the practical focus of the last few weeks, you are invited to dive into the 'heart' of your connections. Be bold in your vulnerability. You are realizing that true power isn't about control; it's about the courage to be truly known. Trust the heat of the moment—it’s burning away the old armor and revealing the powerhouse underneath."
    },
    {
        "title": "Aquarius Daily Horoscope ♒ - January 30, 2026",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, the Moon moves into your opposite sign today, putting a warm, dramatic spotlight on your relationships. With the Sun in your sign, you are the director, and your partners are the stars. It’s a beautiful day for seeing your own light reflected in the eyes of others. If a connection has felt clinical or cold, bring the 'Leo fire' to it. Be generous with your praise and your presence. You are learning that your vision for the future is only complete when shared with others."
    },
    {
        "title": "Pisces Daily Horoscope ♓ - January 30, 2026",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, today is about taking pride in the work of your hands and the health of your body. The Leo Moon is energizing your daily routines. If you’ve been feeling a bit sluggish, this fire energy gives you the 'heart' to start a new rhythm. Find joy in the small tasks. When you treat your daily life like a work of art, everything changes. You are the healer of the zodiac, but today, make sure you are the one receiving the care. You deserve to feel vibrant and strong."
    }
]
