[
    {
        "script_text": "Aries, the stars are handing you a golden bridge today. With the Moon in Sagittarius sextiling the Sun in your career sector, your big ideas finally have a practical path to reality. It’s a day for high-level thinking—don't get bogged down in the small stuff. A professional opportunity involving travel or teaching might surface this afternoon. Trust your gut and act with confidence. Your fire is burning bright, and the world is taking notice of your visionary leadership.",
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Taurus, your intuition regarding money and shared resources is razor-sharp today. The Sagittarius Moon encourages you to look for growth, while the Capricorn Sun provides the stability you crave. It’s a powerful day for negotiating a deal or restructuring a debt. In your personal life, a deep conversation helps clear the air and build a stronger foundation for the future. Trust the process of transformation; you are shedding old skins to make room for a much wealthier version of yourself.",
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Gemini, the focus is on your partnerships today, and the energy is incredibly supportive. Someone in your circle might offer a perspective that changes your entire game plan for the month. With the Moon in your opposite sign, you are learning through the eyes of others. Don’t be afraid to collaborate or seek advice. A balance between your curiosity and your long-term goals is finally within reach. Stay open to a surprise invitation this evening—it could lead to a brilliant alliance.",
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Gemini.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Cancer, your productivity is through the roof today. The Sagittarius Moon brings a sense of joy to your daily tasks, while the Capricorn Sun helps you stay focused on your primary objectives. If you’ve been procrastinating on a health goal or a work project, today provides the perfect surge of energy to get it done. You are finding that when you organize your environment, your mind follows suit. Stay active, keep your spirits high, and enjoy the satisfaction of a job well done.",
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Cancer.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Leo, romance and creativity are calling your name! The Sagittarius Moon is lighting up your house of joy, making you feel more vibrant and expressive than you have in weeks. This is an ideal day to share your heart or launch a creative passion project. Your magnetic energy is grounded by the Capricorn Sun, ensuring that your fun today leads to lasting results tomorrow. Don't dim your light for anyone; the world is ready to be inspired by your unique brand of magic.",
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Virgo, today is about finding peace in your personal space. The Sagittarius Moon encourages you to expand your home life, perhaps through redecorating or a family gathering, while the Capricorn Sun supports your creative expression. You are realizing that a stable home base is the secret to your professional success. Trust your instincts when it comes to domestic matters. A moment of quiet reflection this evening will bring a major realization about your future. Your roots are strong, and you are ready to grow.",
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Libra, your communication skills are your greatest asset today. The Sagittarius Moon makes you a persuasive and charming speaker, while the Capricorn Sun ensures your message is practical and well-received. It’s an excellent day for meetings, writing, or learning something new. You are building bridges between your big ideas and your home life. A neighbor or sibling might have a piece of information that solves a problem you’ve been dwelling on. Stay curious and keep the conversation flowing—you are on a roll!",
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Libra.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Scorpio, your focus is on abundance and self-worth today. The Sagittarius Moon encourages you to look for new income streams, while the Capricorn Sun helps you communicate your value to the world. You have the discipline to turn a small idea into a significant financial gain. Don’t settle for less than you deserve. Your intuition regarding investments is peaked, so trust your gut but stay grounded in the facts. You are building a secure empire, one strategic move at a time. Prosperity is yours.",
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Scorpio.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Sagittarius, the Moon is still shining in your sign today, and it’s making a beautiful connection to the Sun. This is your moment of maximum clarity. You are able to see exactly how your personal dreams fit into your long-term career goals. Don’t hide your light—share your vision with authority. People are drawn to your optimism and your truth. A financial realization this afternoon gives you the green light for a bold new adventure. Your path is clear; keep moving forward with joy.",
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Sagittarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Capricorn, you are the powerhouse of the zodiac, but today’s energy is more about strategy than speed. With the Moon in your sector of intuition, your subconscious is feeding you brilliant ideas for your professional life. Take time for solitude and meditation. You are preparing for a major breakthrough, and the quiet work you do now is essential. Trust the messages you receive in your dreams or during a quiet walk. You are working from the inside out, and the results will be magnificent.",
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Capricorn.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Aquarius, your social life is a source of great inspiration today. The Sagittarius Moon brings exciting new people into your orbit, while the Capricorn Sun helps you filter those connections into your long-term goals. It’s a brilliant day for networking or launching a community project. You are finding your tribe and realizing that your unique visions are shared by others. Stay open to a group collaboration—it could be the catalyst for the change you’ve been working toward. Your future is looking brighter by the minute.",
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aquarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Pisces, your career is reaching a beautiful high point today. The Sagittarius Moon shines on your public status, while the Capricorn Sun supports your network and social circles. You have the respect of your peers and the vision to lead. If you’ve been waiting for a sign to step into the spotlight, this is it. Your intuition is guiding your professional moves, helping you make choices that are both profitable and meaningful. Believe in your worth and let your success be your loudest statement.",
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Pisces.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    }
]
