[
    {
        "script_text": "Aries, today you are balancing on a tightrope between your career goals and your personal relationships. The Libra Moon is asking for compromise, but your ruling planet Mars is pushing for total control in the workplace. The secret to success today is 'soft power.' Don't force a decision; instead, listen to your partners. A collaborative approach will actually speed up your progress. Stay patient, stay grounded, and watch how the doors open for you by this evening.",
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Taurus, your focus today is on the intersection of health and productivity. The stars are urging you to refine your daily routine to support your long-term ambitions. With Venus in Sagittarius, you may feel an urge to gamble on a new idea—trust your intuition but verify the facts. A small adjustment to your diet or sleep schedule will provide the energy boost you need to tackle a major project. Remember, Taurus, consistency is your greatest superpower for long-term wealth.",
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Gemini, the creative spark is bright today as Jupiter remains a dominant force in your sign. You have a unique ability to see solutions where others see problems. However, the Libra Moon suggests that your romantic or social life needs a bit of balance. Don't let your intellectual pursuits alienate those you love. Share your ideas with a spirit of playfulness. A conversation with a creative peer this afternoon could turn a simple thought into a profitable reality.",
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Gemini.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Cancer, your inner world and outer responsibilities are clashing today. While you want to retreat into your shell for some much-needed rest, the Capricorn Sun and Mars are demanding your attention in the public sphere. Find a middle ground by setting firm boundaries. You don't have to say 'yes' to everything. A deep, honest conversation with a family member provides the emotional security you need to face professional challenges. Trust your gut; it’s never been more accurate.",
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Cancer.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Leo, your communication skills are your ticket to success today. Whether you’re negotiating a deal or smoothing over a misunderstanding, your words carry weight and charm. The Libra Moon is helping you find the right tone for every audience. Be careful not to let your ego drive your decisions—instead, focus on how your actions benefit the collective. A surprise message from a neighbor or sibling could bring a smile to your face and a new perspective to your work.",
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Virgo, today is a day for financial strategy. The stars are asking you to look closely at your values and how they align with your income. The Capricorn energy is supporting your creative talents, but the Libra Moon warns against impulse spending on 'theoretically' useful gadgets. Focus on what is essential. A practical conversation about shared resources or investments will yield positive results. You are building a mountain of stability, Virgo—just take it one small stone at a time.",
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Libra, the Moon is still in your sign, making you the emotional barometer of the zodiac today. You are feeling the pressure to please everyone, but the square to Capricorn suggests you must prioritize your own foundation first. It’s okay to be a little 'selfish' if it means protecting your peace. A professional opportunity might require you to step out of your comfort zone. Trust your natural grace to navigate any tension. Tonight, focus on self-care and gentle movement.",
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Libra.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Scorpio, you are operating behind the scenes today, which is exactly where you thrive. The Libra Moon is activating your subconscious, bringing vivid dreams and deep insights. Pay attention to your intuition—it’s warning you about a minor detail in a contract or agreement. The Capricorn stellium is sharpening your mind, making it a great day for research and planning. Avoid the lime-light for now; your power is growing in the shadows. A revelation tonight changes everything.",
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Scorpio.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Sagittarius, today is all about your community and your long-term vision. With your ruler Jupiter in an expansive mood, you are dreaming bigger than ever. However, the Libra Moon asks you to check in with your friends and collaborators. Are you all on the same page? A financial matter related to a group project may need a practical touch. Use the Capricorn energy to ground your big ideas into a workable plan. Your enthusiasm is contagious—use it wisely!",
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Sagittarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Capricorn, you are the focal point of the zodiac’s energy right now. With the Sun, Mars, and Mercury in your sign, your drive is unmatched. Today, the Libra Moon challenges you to consider your public image versus your private reality. Are you working for the applause or for the achievement? Balance your ambition with a moment of social connection. A small gesture of appreciation toward a colleague will go a long way in securing your professional legacy. Keep climbing!",
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Capricorn.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Aquarius, the stars are inviting you to expand your horizons through study or travel planning. The Capricorn energy is working quietly in your 12th house, helping you heal old wounds while the Libra Moon encourages you to seek out new philosophies. If you feel a bit disconnected from the daily grind, it’s because your soul is craving meaning. Trust the process of your internal growth. A mentor from your past might reappear with a message that clarifies your future path.",
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aquarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Pisces, today focuses on your shared resources and deep emotional bonds. The Libra Moon is asking for fairness in your partnerships, while the Capricorn stellium helps you network with people who can help you reach your goals. If a financial matter feels heavy, look for a creative solution rather than a purely logical one. Your empathy is a strength, but don't let it become a liability. Set healthy boundaries and trust that you are worthy of the abundance coming your way.",
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Pisces.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    }
]
