[
    {
        "title": "Aries Daily Horoscope ♈ - January 29, 2026",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, today might feel like a tug-of-war between your public ambitions and your private needs. If you’re feeling extra pressure from home or family, don't just push through it with your usual force. The stars are asking you to look at a deep-rooted pattern. Are you running toward work to avoid an emotional truth? Be brave enough to stay in the room with your feelings today. You are stronger when your foundation is honest."
    },
    {
        "title": "Taurus Daily Horoscope ♉ - January 29, 2026",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, a conversation today could feel much heavier than you expected. As the Moon opposes Pluto, the words you speak—or the ones you hear—have a transformative power. Don't shy away from the 'real' talk. If you’ve been holding onto a grudge or a secret, today is the day it wants to be heard. You don't have to have all the answers; you just have to be willing to be real. Truth is the only thing that will set you free today."
    },
    {
        "title": "Gemini Daily Horoscope ♊ - January 29, 2026",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, today’s energy is hitting your sector of values and resources. You might feel a sudden spike of anxiety regarding money or your self-worth. I want you to take a deep breath. This isn't about your bank account; it’s about your belief in your own power. Stop letting old fears dictate how you value yourself. You are shedding a skin of 'not enoughness.' Trust that as you let go of the old scarcity mindset, you make room for true abundance."
    },
    {
        "title": "Cancer Daily Horoscope ♋ - January 29, 2026",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, the Moon is in your sign today, but it’s facing off with Pluto. This can feel like a personal 'rebirth.' You might feel more sensitive than usual, but there is incredible power in that sensitivity. You are realizing that you can't keep everyone else happy at the expense of your own soul. Don't be afraid to set a firm boundary today. You aren't being mean; you are being self-respecting. You are evolving, and that requires letting go of the old version of you."
    },
    {
        "title": "Leo Daily Horoscope ♌ - January 29, 2026",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, your inner world is feeling a bit like a stormy sea today. With the Moon opposing Pluto in your house of the subconscious, old ghosts might try to rattle their chains. Don't let them scare you. These are just old memories ready to be released. Spend some time in quiet reflection or journaling. You are uncovering a hidden source of strength within yourself. Once you face the shadow, it loses all its power. You are coming into a much deeper authority."
    },
    {
        "title": "Virgo Daily Horoscope ♍ - January 29, 2026",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, today could bring a shift in your social circles or a realization about a long-term dream. If a friendship feels strained or a group dynamic feels 'off,' trust your intuition. You are seeing the power plays for what they are. Don't feel like you have to fix it—sometimes you just have to witness it. You are learning who truly belongs in your future and who was just part of your past. Stay true to your integrity; it’s your best compass today."
    },
    {
        "title": "Libra Daily Horoscope ♎ - January 29, 2026",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, you are standing at a crossroads between your career and your inner peace today. As the Moon and Pluto face off, you might feel like you’re being pulled in two directions. I know you hate conflict, but don't try to please everyone today. If a professional demand feels like it’s crushing your spirit, listen to that feeling. You are being asked to redefine what 'success' actually looks like for you. Balance isn't found in doing it all—it’s found in doing what matters."
    },
    {
        "title": "Scorpio Daily Horoscope ♏ - January 29, 2026",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, your belief systems are under the microscope today. You might find yourself questioning a long-held opinion or a philosophy that used to bring you comfort. Don't be afraid of the doubt. It’s part of your evolution. As the Moon opposes your ruler, Pluto, you are being invited to see the world with new eyes. Let go of the need to be 'right' and embrace the need to be 'real.' Your wisdom is deepening through this process. Trust the shift."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐ - January 29, 2026",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, today’s energy is hitting your house of intimacy and transformation. It’s a 'deep dive' day. You might feel a sudden intensity in a close relationship or a realization about a shared financial matter. Whatever comes up, don't try to outrun it with your usual optimism. Sit with the complexity. You are learning that true freedom comes from facing the deep stuff, not just moving past it. You are building a much more powerful and honest connection with yourself."
    },
    {
        "title": "Capricorn Daily Horoscope ♑ - January 29, 2026",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, the focus is on your partnerships today, and it feels intense. The Moon in your opposite sign is facing off with Pluto, which may bring a power struggle to the surface. If you feel like someone is trying to control you—or if you’re trying to control them—stop. This is about trust. You are releasing old ways of relating that were built on fear rather than love. Be vulnerable enough to speak your truth without the armor. That’s where the real breakthrough lives."
    },
    {
        "title": "Aquarius Daily Horoscope ♒ - January 29, 2026",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, your daily routine and your health are in the spotlight today. You might feel a sudden urge to radically change how you take care of yourself. As Pluto in your sign opposes the Moon, you are realizing that your old habits just aren't sustainable for the person you’re becoming. Don't just make a small change—make a soul-level one. Listen to what your body is screaming for. You have the power to transform your life from the ground up starting today. Seize it."
    },
    {
        "title": "Pisces Daily Horoscope ♓ - January 29, 2026",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, your creative heart is feeling the heat today. Whether it’s a romantic connection or a project you’re passionate about, things feel 'all or nothing.' Don't be afraid of the intensity—it’s the fuel for your next masterpiece. However, make sure you aren't giving your power away to someone else’s drama. You are the creator of your own joy. Use this deep emotional energy to express something you’ve been afraid to say. Your vulnerability is your most powerful art today."
    }
]
