[
    {
        "script_text": "Dear Aries, the Leo Moon enters your 10th House, signifying a顼 wise phase for career and reputation. Mars conjuncts your 8th—you’re empowered to pursue desires with passion but beware overindulgence. Venus trines Neptune in your 5th House—a portal to uninhibited creativity and romance. However, Saturn in Gemini retrogrades in your 12th, urging habits review. As Venus and Neptune blend, you’re blessed with artistic inspiration; aid others to manifest positivity. Challenge: don’t let Neptune cloud your business focus. Blessing: Your discernment will ascend!",
        "title": "ARIES Monthly Forecast January 2026",
        "target": "ARIES",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/ARIES.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Aries Monthly Forecast - THIS is Your January! #shorts",
        "youtube_description": "ARIES: What will be your brightest achievement, greatest challenge—is love destiny or illusion this month?\nUnlock visions: is Saturn retrograde affecting your plans?\nComment below: Are you blessed or cursed by this mystical forecast?\n#ARIES #Astrology #January2026 #shorts #VenusTrineNeptune",
        "youtube_tags": [
            "#astrology",
            "#Aries",
            "#January2026",
            "#MysticVideo",
            "#shorts",
            "#VenusNeptune1",
            "#ARIESJanuary",
            "#CosmicDirection",
            "#PersonalizedAstrology",
            "#MonthlyForecast",
            "#InspirationalAstrology",
            "#VideoAstrology",
            "#AstrologyVlog",
            "#CosmicEnergy",
            "#Divination",
            "shorts",
            "viral",
            "astrology",
            "aries"
        ]
    },
    {
        "script_text": "Golden Taurus, this month is defined by the harmonious Venus–Neptune trine igniting your creative sector, blending beauty, illusion, and artistic flow. Mars rises in your rebel Neptune House, urging bold innovation and risk-taking. Saturn slips retrograde in your 8th, prompting new opportunities through rebirth and deep transformation. Watch for opportunistic money deals; beauty blurs try every new adventure. A blessing: your intuitive insights turn setbacks into golden gifts. The warning: outsiders may exploit your trust, so stay discerning. New alliances and a spiritual vision will refine your purpose.",
        "title": "TAURUS: January 2026 Major Arcana Shift & Creative Blessing",
        "target": "TAURUS",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/TAURUS.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "TAURUS January 2026: Venus Meets Neptune, are you destined for artistic gold? #shorts",
        "youtube_description": "How is Venus’s Neptune trine changing your creative vibe this month? Will Saturn’s retrograde unlock new opportunities? Discover 2026’s unexpected blessings for Taurus!\n\nWhich artist inspires you this month and how will you protect your wisdom? Join the conversation below! #xo",
        "youtube_tags": [
            "#astrology",
            "#TAURUS",
            "#TaurusForecast",
            "#2026Astrology",
            "#manifestation",
            "#mysticalreading",
            "#planetsinTAURUS",
            "#JanuaryHoroscope",
            "#creativeinspiration",
            "#spirituality",
            "#astrologyshorts",
            "#newbeginnings",
            "#astrology2026",
            "#real querent",
            "#astrologyviral",
            "shorts",
            "viral",
            "astrology",
            "taurus"
        ]
    },
    {
        "script_text": "GEMINI. The Tower card collapses this month, shattering your rigid routines. Mars, your ruling planet, moves into Aries and your 11th House of Networks, fueling aggressive innovation. This is a firestarter for digital projects. Simultaneously, Venus trines Neptune in your 10th House of Career, dissolving boundaries between art and income. A specific blessing: Your charisma peaks around January 28th; pitch your wildest idea. A specific warning: Mars squares Pluto in your 6th House of Health. Do not ignore inflammation or burnout. The chaos is not a dead end, but a structural renovation. Your mind is the blueprint.",
        "title": "Gemini January 2026: The Tower's Truth",
        "target": "GEMINI",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/GEMINI.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Gemini: DO THIS Before January Ends! (Major Warning) #shorts",
        "youtube_description": "Did you feel the sudden shake-up, Gemini? With Mars firing up your social sector, are you ready to lead or follow?\n\nThe Tower card signals a necessary collapse. Will you use this energy for innovation or chaos?\n\n#Gemini #Astrology #TowerCard #Manifestation",
        "youtube_tags": [
            "#Gemini",
            "#Astrology",
            "#Horoscope",
            "#TowerCard",
            "#Manifestation",
            "#Numerology",
            "#Zodiac",
            "#Spirituality",
            "#AstrologyReading",
            "#Tarot",
            "#NewMoon",
            "#FullMoon",
            "#AstrologyMemes",
            "#GeminiSeason",
            "#LawOfAttraction",
            "#Trending",
            "#Shorts",
            "#January2026",
            "#PlanetaryShift",
            "shorts",
            "viral",
            "astrology",
            "gemini"
        ]
    },
    {
        "script_text": "Cancers of the world, the Moon is rising in Taurus this month, blessing you with grounded wisdom and profound self-love. However, Saturn’s transit into your 10th House over the next two weeks brings critical introspection—examining your professional path and public image. Your blessing: With Venus trining Neptune in your creative sector, inspiration and poetic luck flourishes—trust your inner muse. Beware an unexpected setback from retrograde Mercury stirring.wordplay, now’s the perfect time for honest reflection, emotional hygiene, and confidencereon.",
        "title": "Cancer Astrology January 2026 Forecast",
        "target": "CANCER",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/CANCER.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Cancer January 2026 Astrology Forecast: Blessing, Warning, Transformation! #shorts",
        "youtube_description": "Your January 2026 fate is written in the stars! See which planet rules your destiny this month.\n\nIs this your lucky season for romance, career, or creative expression?\n\nDon’t forget to like, comment, and subscribe for daily cosmic forecasts!\n\n#Astrology #Cancer #Tarot #CosmicTrend",
        "youtube_tags": [
            "astrology",
            "cancer",
            "Astrology2026",
            "tarot",
            "spirituality",
            "astrologyshorts",
            "newyear",
            "cancerforecast",
            "spiritualinspiration",
            "soulmaverick",
            "planetaryshifts",
            "monthlyprediction",
            "cosmicbody2026",
            "tarotreading",
            "astrologershow",
            "spiritualguidance",
            "lovehoroscope",
            "selfdevelopment",
            "newmuse",
            "daily astrology",
            "shorts",
            "viral"
        ]
    },
    {
        "script_text": "Sunday, January 18th. Your cosmic signature shifts under Venus trine Neptune in your creative house—a powerful surge into imaginative realms and artistic inspiration. Elsewhere, Mars slips into the 8th House, inciting passion, transformations, and intense desires. Venus remains locked in a sweet trine, elevating joy and romance. Watch for Saturn’s strict enforcement as it moves into the Capricorn 10th, prompting deep structure and responsibility. Warning: Unchecked desire may pull you toward risky romantic entanglements. Blessing: Your artistic outpouring and self-love radiate. Stand by your vision, and let magic unfold.",
        "title": "Leo's January Full Golden Forecast",
        "target": "LEO",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/LEO.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "LEO's January 2026 Major Arcana Shifts! Destiny Unveiled #shorts",
        "youtube_description": "Will your creativity transform your life? Check out this cosmic guide for Leo ahead! Venus blends with Neptune—what does it mean for your imagination? Welcome to the magic of astrology!\n\n#Astrology #LEO #fortune #January",
        "youtube_tags": [
            "#astrology",
            "#Leo",
            "#JanuaryForecast",
            "#horoscope",
            "#2026",
            "#shorts",
            "#Venus",
            "#Mars",
            "#Saturn",
            "# manifestation",
            "#creative",
            "#romance",
            "#spirituality",
            "#Tarot",
            "#zodiac",
            "#astrologyshorts",
            "shorts",
            "viral",
            "astrology",
            "leo"
        ]
    },
    {
        "script_text": " hear, Virgo—the scales have tipped. Mars enters Aquarius, igniting your drive with unexpected visions. Venus trines Neptune this month—creativity flows like magic, but beware of illusion. Saturn rests in Leo—adjust career moves for unexpected leadership. Synchronize energy—follow the stars for prosperity. Heed: Don’t let curiosity mask duty—focus on clarity, not fantasy. Blessing: Your patience will reward you massively.",
        "title": "Virgo 2026 January Forecast Astrology",
        "target": "VIRGO",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/VIRGO.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Virgo's JANUARY Destiny Reveal! #shorts",
        "youtube_description": "Is your January filled with hidden luck or traps? Let Virgo's astrologer decode fate!\nComment: What's your biggest fear this January?\nGet your private horoscope!\n# astrology # Virgo # January # destiny",
        "youtube_tags": [
            "#astrology",
            "#VIRGO",
            "#January2026",
            "#shorts",
            "#astrology2026",
            "#planetsinhouses",
            "#Tarot",
            "#careeradvice",
            "#manifestation",
            "#horoscope",
            "#spirituality",
            "#mystic",
            "shorts",
            "viral",
            "astrology",
            "virgo"
        ]
    },
    {
        "script_text": "Leo, prepare for a dazzling month ahead symbolized by The Moon. Venus gently trines Neptune in your creativity sector, unlocking boundless inspiration and spiritual heights—a blessing for artists, lovers, and dreamers. However, watch as your fair Jupiter (compassion, luck) square the Sun, urging healthier boundaries and authentic connection. Saturn’s steady, looming presence in the fifth house reminds you of life’s give-and-take. This is your time for balance, love’s growth, but be cautious of attachment issues or betrayals. Trust your inner core; your vibe will draw treasures and romance.",
        "title": "Your Astrological Blueprint for January 2026 | LIBRA",
        "target": "LIBRA",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/LIBRA.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Libra Destiny FULFILLED? Jupiter, Venus & Saturn Shock in January 2026 #shorts",
        "youtube_description": "Your love life & luck are about to flip! Will Venus’s magic transform your dreams?\nWhat’s the blind spot in your relationships?\nHow will Saturn’s pressure shape your creativity?\nLeave a comment below with your thoughts and sign! \n#astrology #LIBRA #2026 #shorts",
        "youtube_tags": [
            "astrology",
            "2026",
            "LIBRA",
            "Zodiac",
            "January horoscope",
            "scorpio",
            "aries",
            " Sagittarius",
            "Taurus",
            "Virgo",
            "Gemini",
            "Venus trines Neptune",
            "Jupiter square Sun",
            "manifestation",
            "celestial predictions",
            "shorts",
            "viral",
            "libra"
        ]
    },
    {
        "script_text": "Dear Scorpio, October is the month of transformation as Venus glides into trine Neptune behind Mercury, illuminating your karmic pathways. Saturn retrogrades through the 11th House, urging introspection and truth-telling within your community circles. With Mars in the 7th House facing Jupiter's expansion, approach relationships with curiosity and vulnerability. Watch your private domain—there is a surge of creative energy shaking up your inner world. Seek insights from hidden wisdom, but beware of illusions—clarity will reveal deep truths.",
        "title": "SCORPIO October 2025 Prediction - Visionary Shift!",
        "target": "SCORPIO",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/SCORPIO.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "SCORPIO October Magic: Neptune & Mercury Unleashed! #shorts",
        "youtube_description": "What secrets awaits you in October? Venus's magic aligns with Neptune—don’t get lost in fantasy!\n Saturn stirs mystery in your air signs—what lies in your shadows?\n Dive in! Comment your biggest October transformation!\n #SCORPIO #Astrology #VenusNeptune #November2025",
        "youtube_tags": [
            "#astrology",
            "#SCORPIO",
            "#VenusNeptune",
            "#February2026",
            "#AstrologyShorts",
            "#MarsAstrology",
            "#Saturn",
            "#AstrologyPredictions",
            "#AstrologyCommunity",
            "#MonthlyAstrology",
            "#OctoberAstrology",
            "#Relationships",
            "#PersonalGrowth",
            "#CosmicEnergy",
            "#AstrologyForYou",
            "shorts",
            "viral",
            "astrology",
            "scorpio"
        ]
    },
    {
        "script_text": "Welcome, brave Sagittarius, to your January 2026 celestial forecast. This month the Star Card, the Major Arcana card of The Star, illuminates your path, guiding expansion through the Ninth House of higher learning. As Mars charges through your Fifth House of creativity, expect dynamic energy in self‑expression, but beware an opposition from Saturn in your Tenth House that may stall career progress. Venus forms a harmonious trine with Neptune in your sector of artistic imagination, blessing you with visionary inspiration, yet a square from Uranus in the Eleventh House warns of sudden, unpredictable shifts in friendships. Embrace the blessing of heightened intuition, but avoid impulsive commitments under Mercury’s retrograde shadow. Trust the universe’s rhythm, release fear, and step boldly into the growth that awaits. Your aura glows radiant, destiny whispers success wherever you dare to explore, and the cosmos applauds your boundless courage and growth.",
        "title": "Sagittarius Jan 2026 Astrology Forecast",
        "target": "SAGITTARIUS",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/SAGITTARIUS.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": true,
        "date": "Jan 16",
        "youtube_title": "Sagittarius SECRET January 2026 Fortune Shocking! ⚡️ #shorts",
        "youtube_description": "🔮 How will Jupiter guide your month? Share your insights below!\n💫 Which hidden blessing is waiting for you? Drop a comment!\n✨ Which tarot card speaks to you? #Sagittarius #Astrology #January2026 #Divination",
        "youtube_tags": [
            "#astrology",
            "#sagittarius",
            "#january2026",
            "#tarot",
            "#manifestation",
            "#horoscope",
            "#cosmicweather",
            "#zodiac",
            "#spiritualawakening",
            "#tarotreading",
            "#celestial",
            "#futureforecast",
            "#monthlyforecast",
            "#youtubeshorts",
            "#shorts",
            "#fyp",
            "#viral",
            "#cosmicguidance",
            "shorts",
            "viral",
            "astrology",
            "sagittarius"
        ]
    },
    {
        "script_text": "Capricorn, January 2026 heralds an era of perfection—Saturn gleams in your 10th, cementing career triumphs and public acclaim. Mars spins harmoniously through the air, sparking leadership initiatives and ambition-driven change. Yet Venus’ trine to Neptune infuses your creative sphere with a surreal, dreamlike luxury—be wary of clouded decisions in relationships or artistic ventures. Seek clarity. The blessing? With Venus-Neptune synergy, now is the time to let intuition guide true manifestations. Own this flow and watch transformation unfold. May your 2026 be defined by ambition realized and beauty manifesting unexpectedly. Fast forward: Capricorn, your vision becomes destiny.",
        "title": "Capricorn January 2026: Career Ascendancy & Conditional Beauty",
        "target": "CAPRICORN",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/CAPRICORN.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Capricorn January 2026 Astrology Forecast: Big Career News & Hidden Blessings #shorts",
        "youtube_description": "Discover the secrets shaping Capricorn’s month ahead! Will your ambitions flourish, and what cosmic gift awaits? Leave your lucky color below! comments welcome. Destiny is in your hands—watch this!",
        "youtube_tags": [
            "#Capricorn",
            "#Astrology",
            "#Zodiac",
            "#January2026",
            "#AstrologyForecast",
            "#Manifestation",
            "#CareerGrowth",
            "#Mars",
            "#Venus",
            "#Neptune",
            "#Saturn",
            "#Celestial",
            "#Horoscope",
            "#Shorts",
            "#StarSign",
            "#Cosmic",
            "#Divination",
            "AstrologyVibes",
            "#FutureTrends",
            "#Journaling",
            "shorts",
            "viral",
            "astrology",
            "capricorn"
        ]
    },
    {
        "script_text": "AQUARIUS, this month’s cosmic dance begins with the gentle but persistent movement of Saturn as it deepens in your 4th House, strengthening foundations for long-term heart and home stability. Meanwhile, Uranus graces your 9th House, sparking innovation and fate-driven adventures. Venus harmoniously trines Neptune in your sector of creativity, unlocking teleportation via art, music, or spirituality. However, this transformative surge could also incite creative blocks if not channeled with clarity. Your blessing: When Saturn rules, trust the slow burn, for all creative energy now flows with cosmic timing. Warning: Avoid over改變ing for the sake of change—preservE the wisdom of your roots You're at a crossroads where destination meets destiny. Harvest your uniqueness.",
        "title": "AQUARIUS Monthly Forecast: Uranus Awakens | Creativity, Change & Cosmic Shifts 2026",
        "target": "AQUARIUS",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/AQUARIUS.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "AQUARIUS 2026: Destiny Changes NOW! Saturn URGENT MESSAGE! #shorts",
        "youtube_description": "Are these cosmic alignments pushing you towards a major creative breakthrough this month?\nHow will Uranus’s influence awaken your unconventional potential?\nIs Saturn’s presence urging deeper change in your core?\nDrop a comment with your predictions! #Astrology #AQUARIUS #Creativity #Transitions",
        "youtube_tags": [
            "#Astrology",
            "#AQUARIUS",
            "#Uranus",
            "#Saturn",
            "#Venus",
            "#Neptune",
            "#2026Astrology",
            "#CosmicShift",
            "#Creativity",
            "#Destiny",
            "#Spirituality",
            "#MoonSign",
            "#FacebookAstrology",
            "#Mysticism",
            "#News",
            "#YouTubeAstrology",
            "shorts",
            "viral",
            "astrology",
            "aquarius"
        ]
    },
    {
        "script_text": "Pisces, this month the Moon shifts into Pisces itself, echoing the water within. Venus harmoniously trines Neptune in your sector of creativity—your artistic messages will resonate and inspire others, bringing both hidden love affairs and unexpected gifts of gratitude. Mars slips into your 8th House, igniting an undercurrent of potent transformation; trust your intuition, but watch for financial entanglements with unknowns. Saturn looms in the 12th, urging you to release old attachments and trust in spiritual protection. Beware emotional whiplash as you navigate the shifting tides—listen to your dreams, for they hold truth and keys to boundless healing.",
        "title": "Pisces: Mystical January Forecast",
        "target": "PISCES",
        "type": "monthly",
        "images": [
            "assets/zodiac_signs/PISCES.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Pisces Moon in Pisces! Hidden Love & Neptune Trine Brings Spiritual Miracles #shorts",
        "youtube_description": "Can Neptune’s blessing guide your art to its destiny this month?\nUnlock hidden talents during this Pisces glow—don’t miss out!\nHow will Mars in the 8th shift your finances? Let me know in the comments!\n#PISCES #Neptune #Astrology #MoonPhase",
        "youtube_tags": [
            "#PISCES",
            "#Astrology",
            "#Neptune",
            "#MarsEnergy",
            "#MonthlyForecast",
            "#JanuaryAstrology",
            "#SpiritualHealing",
            "#2026Astrology",
            "#YouTubeAstrology",
            "#AstrologyShorts",
            "#ForbesHoroscope",
            "#MyAstrology",
            "#LoveAstrology",
            "#MarsMagic",
            "#VenusTrineNeptune",
            "shorts",
            "viral",
            "astrology",
            "pisces"
        ]
    }
]