[
    {
        "title": "Aries Daily Horoscope ♈ - January 25, 2026",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, I know you usually want to conquer the world by noon, but today the stars are inviting you to just enjoy it. With the Moon in steady Taurus, your focus shifts to your physical comfort and your sense of security. If you’ve been worrying about money or 'enoughness,' take a breath. You have everything you need right now. Treat your body with kindness today—eat well, rest long, and remember that you don't have to be 'on' to be worthy."
    },
    {
        "title": "Taurus Daily Horoscope ♉ - January 25, 2026",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, the Moon is home in your sign today, and it’s shining just for you. This is your day for ultimate self-care. If you’ve been carrying the emotional weight for others, today is the day to set it down. Surround yourself with things that feel, smell, and taste good. You are the anchor of the zodiac, but even an anchor needs to rest in the sand sometimes. Honor your needs without apology. You are deeply loved and exactly where you belong."
    },
    {
        "title": "Gemini Daily Horoscope ♊ - January 25, 2026",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, your mind is usually a fast-moving river, but today it slows into a peaceful lake. The Taurus Moon is highlighting your need for spiritual rest. If you feel a bit more introverted than usual, honor that quiet. You are processing deep shifts behind the scenes. Trust the dreams you have today; they are grounded in a truth your waking mind might miss. Find a sanctuary in your own thoughts and let the world spin without you for a while."
    },
    {
        "title": "Cancer Daily Horoscope ♋ - January 25, 2026",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, today is about the family you choose. The Taurus Moon brings a sense of loyalty and warmth to your friendships and community. I see you finding deep comfort in a shared meal or a long, steady conversation. You don't need excitement today; you need connection. Lean into the people who have stood by you through it all. You are realizing that you are part of a beautiful, grounded circle. Your heart is safe here."
    },
    {
        "title": "Leo Daily Horoscope ♌ - January 25, 2026",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, you’ve been working so hard to build your legacy, but today the stars ask you to enjoy the view. Your career and public life are illuminated by a steady, successful light. If you’ve felt a bit of 'imposter syndrome' lately, the Taurus Moon reminds you that your success is built on a solid foundation of hard work. Take a moment to acknowledge how far you’ve come. You don't have to roar today to be seen. Your quiet confidence is enough."
    },
    {
        "title": "Virgo Daily Horoscope ♍ - January 25, 2026",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, your wisdom is your sanctuary today. The Taurus Moon encourages you to expand your horizons in a grounded way. Whether it’s reading a book that feeds your soul or taking a slow walk in a new place, follow the call of your curiosity. You are finding that the more you learn, the more peaceful you feel. Don't over-analyze the path forward—just enjoy the walk. The universe is providing you with the clarity you’ve been seeking. Trust the journey."
    },
    {
        "title": "Libra Daily Horoscope ♎ - January 25, 2026",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, today is about deep roots and deeper trust. The Taurus Moon is moving through your house of intimacy and shared resources, making it a perfect day for soul-level connection. If you’ve been holding back your true feelings, today you find the strength to be vulnerable. You are learning that real intimacy isn't just about the pretty moments—it's about the steady, reliable ones. Trust the bonds you’ve built. You are more supported than you realize."
    },
    {
        "title": "Scorpio Daily Horoscope ♏ - January 25, 2026",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, the focus is squarely on your heart’s partnerships today. As the Moon moves through your opposite sign, Taurus, you are seeing the value of loyalty over drama. If a relationship has felt rocky, today provides the grounded energy needed to smooth things over. You don't need to dig for secrets today; just enjoy the presence of those you love. Your intensity is softening into a beautiful, steady glow. Let yourself be loved for exactly who you are."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐ - January 25, 2026",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, I know you love the chase, but today is about the ritual. The Taurus Moon is highlighting your daily habits and your health. Find adventure in the small things—a perfect cup of tea, a stretch, or organizing your space. You are realizing that a stable routine isn't a cage; it’s the foundation that allows you to fly. Take care of your 'temple' today. When your body feels grounded, your spirit feels free to dream even bigger."
    },
    {
        "title": "Capricorn Daily Horoscope ♑ - January 25, 2026",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, joy is a serious business today! The Taurus Moon is lighting up your house of creativity and pleasure. After weeks of hard work, the universe is giving you permission to just have fun. Whether it’s a hobby, a game, or time with children, let your 'inner child' lead the way. You don't have to build a mountain today; you just have to enjoy the one you’re standing on. Your happiness is a vital part of your success. Let it flow."
    },
    {
        "title": "Aquarius Daily Horoscope ♒ - January 25, 2026",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, even a revolutionary needs a home base. Today the Sun in your sign and the Moon in Taurus are asking you to focus on your sanctuary. What makes you feel safe? Spend time in your own space, surrounded by the things and people that ground you. You are building a new future, but that future needs deep roots. Take a moment to appreciate your family and your foundations. When your home is at peace, your vision for the world becomes clearer."
    },
    {
        "title": "Pisces Daily Horoscope ♓ - January 25, 2026",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, your words carry the weight of a warm hug today. The Taurus Moon in your communication sector helps you express your deep feelings in a way that is practical and comforting to others. If a friend is struggling, your steady presence is exactly what they need. You don't have to fix the world today; just be a kind neighbor and a good listener. Your empathy is grounded in a beautiful, earthy wisdom. Speak your truth gently; the world is listening."
    }
]
