[
    {
        "script_text": "Aries, today’s Mars-Sun conjunction in your career sector is like a rocket engine for your ambitions. You have the green light to take bold, decisive action on a professional goal. However, be mindful of your words, as they carry more weight than usual today. Use this intense energy to lead, not to dominate. A moment of kindness toward a colleague this afternoon will build a bridge that serves you for years to come. Trust your fire!",
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Taurus, your ruler Venus is in a tug-of-war with Jupiter today, creating a strong urge to overindulge or take a major risk. While the temptation to escape your routine is high, the stars advise staying grounded in your values. Trust your instincts over your impulses. A long-term financial or travel plan starts to show its true potential now. Listen to your inner voice during the quiet moments this morning—it knows exactly which path leads to true security.",
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Gemini, today is about emotional clearing. You may realize that certain habits or associations no longer fit the person you are becoming. With Mercury conjunct the Sun, your ability to articulate your needs is at a peak. Don't rush into arguments; instead, use your wisdom to navigate tricky conversations. Patience is your superpower today. By letting go of what drains you, you make space for a high-vibration connection that is waiting to enter your life tonight.",
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Gemini.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Cancer, you are feeling a surge of self-assurance as you break free from old emotional restrictions. The opposition between Venus and Jupiter in your sign asks you to balance self-care with your responsibilities to others. Love blossoms in the moments of true understanding, so listen to the unspoken needs of those closest to you. A breakthrough in an ancestral business or a family matter is likely. Move with grace and trust that you are fully supported by the universe.",
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Cancer.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Leo, it’s time to slow down and release the need for total control. The Capricorn stellium is putting pressure on your daily workload, but the stars suggest that 'less is more' today. Focus on your physical well-being and listen to your body’s signals. A financial decision requires a strict budget—avoid impulsive spending on luxury items. By letting go of a minor frustration this afternoon, you’ll find an immediate sense of peace and a clearer path forward.",
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Virgo, your disciplined approach to work is finally bearing fruit, especially in financial matters. However, today’s energy encourages you to find a balance between your drive and your contentment. Not every minute needs to be productive. Take time to breathe and recharge your spirit. A creative project or a romantic interest might demand a quick decision—trust your gut but stay humble. Your wisdom is your greatest asset today, helping you turn a small opportunity into a lasting success.",
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Libra, with the Moon in your sign today, your focus is on personal balance and selective energy. You are being asked to choose your battles wisely and avoid unnecessary drama. Collaborative projects are favored, but make sure everyone’s voice is heard to maintain harmony. A sudden moment of clarity regarding a home or family situation helps you make a firm decision. Stay in your center, Libra. Your inner poise is magnetic and will attract exactly what you need by sunset.",
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Libra.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Scorpio, the energy today demands deep, honest conversations. You are naturally introspective, and sharing your inner thoughts with a partner or trusted friend will foster a powerful sense of closeness. Don't stress about the future today; instead, focus on being fully present in the 'now.' A hidden truth or a lost piece of information may surface this afternoon, giving you the answer you've been seeking. Trust the process of transformation—it is happening quietly but surely.",
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Scorpio.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Sagittarius, your words have immense power today, so pause and think before you speak. The Capricorn Sun and Mars are heightening your drive for financial security, but avoid taking unnecessary risks. A small disagreement could escalate if you lead with quick energy rather than meaning. Use your natural wisdom to guide your expressions. By choosing devotion and patience over a fleeting thrill, you stabilize a key relationship and set the stage for a major win later this month.",
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Sagittarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Capricorn, with the Sun, Mars, and Mercury all in your sign, you are at a peak of personal power. The Mars Cazimi today acts as a divine reset for your willpower. Simplicity is your key to success—don't overcomplicate your plans or your workspace. Focus on one major goal and watch how easily the obstacles melt away. You don't need to prove anything to anyone; your results will speak for themselves. Stay humble, stay focused, and lead with integrity.",
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Capricorn.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Aquarius, you are being nudged to look inward and face a hidden truth. The heavy Capricorn energy is activating your subconscious, making this an ideal day for meditation or psychological breakthroughs. If you feel a surge of energy, use it to complete a project behind the scenes rather than seeking the spotlight. A financial realization helps you see where you've been overspending. By stepping back from the noise, you gain a clear view of your future that is grounded in reality.",
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aquarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Pisces, today is a day for self-reflection and healing old patterns. You may feel a gentle push to release habits that no longer serve your growth. The Moon in Libra encourages you to seek balance in your intimate partnerships, while the Sun in Capricorn highlights your social circles. A creative idea regarding your resources could prove very profitable if you act on it with precision. Trust your intuition—it is whispering the solution to a problem you’ve been dwelling on for weeks.",
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Pisces.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    }
]
