[
    {
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, the high-octane energy of the last two days is beginning to settle. You’ve made your point and started the engine, but today the stars ask: what’s the next practical step? I know you hate to slow down, but there’s a quiet strength in steady progress. Take a breath and look at your resources. You don’t have to do it all in a day. Trust that the seeds you’ve planted are already starting to grow. You are safe to rest."
    },
    {
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, you can feel the shift coming. As the Moon prepares to enter your sign, your world starts to feel a bit more aligned. If the morning feels chaotic, don't let it shake your peace. By this afternoon, you’ll find your rhythm again. Use this energy to reconnect with your senses—a good meal, a walk in nature, or a moment of silence. You are the anchor for those around you today. Your stability is your greatest superpower. Stay grounded."
    },
    {
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, your social life has been buzzing, but today you might feel a sudden need to pull back and process everything. I know you love to stay connected, but your mind needs a break from the static. It’s okay to go quiet for a few hours. You’re synthesizing some big ideas about your future, and that requires a little solitude. Trust your inner voice over the noise of the crowd. You aren't missing out; you’re just tuning in to yourself."
    },
    {
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, the pressure you’ve felt in your career or public life is starting to ease into something more manageable. You’ve shown the world what you’re made of, and now it’s time to look at who is standing by your side. Reach out to a friend who makes you feel seen. Today is about community and shared goals. You don’t have to be the leader every single second. Let yourself be a part of the circle. You are deeply valued and loved."
    },
    {
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, your vision for the future is big and bright, but today the stars are nudging you to look at the 'how.' I know you have the passion, but do you have the plan? Don't let the details dampen your spirit—think of them as the stairs that lead to your throne. A conversation with someone you respect could provide a missing piece of the puzzle. Stay open to feedback. Your wisdom is growing, and your legacy is being built with every thoughtful choice."
    },
    {
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, you’ve been doing some heavy emotional lifting lately, and today you start to see the results. A sense of peace is returning to your deeper world. If you’ve been worried about a financial matter or a shared responsibility, a solution is starting to form. Trust the process of transformation. You are shedding old skin and becoming more resilient. Take a moment to acknowledge how much you’ve healed. You are stronger and wiser than you were just a week ago."
    },
    {
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, the focus is still on your connections, but the energy is shifting from 'conflict' to 'comfort.' If you had a difficult talk recently, today is for the healing that follows. You are learning that true harmony isn't about avoiding tension—it's about working through it. Be honest with your needs. You'll find that the people who truly matter are willing to meet you halfway. Your relationships are becoming more solid and authentic. Trust the love that surrounds you today."
    },
    {
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, your daily grind is starting to feel a bit more rewarding today. You’ve put in the work to organize your life, and now you’re seeing the benefits of that discipline. If you’ve been feeling physically tired, listen to your body’s call for rest this evening. You are building a life of purpose, but you can’t do that if your tank is empty. Reward yourself for your small wins. You are making incredible progress, even on the days it feels slow."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, the fiery spark of joy you’ve felt lately is grounding into something more lasting. You’re realizing that your happiness doesn’t have to be a fleeting moment—it can be a foundation. If you started a creative project or a new romance, today is a great day to nourish it. You don't need to chase the next big thrill. Find the magic in what you’ve already started. Your heart is full, and your spirit is steady. Enjoy the beauty of the present."
    },
    {
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, your focus remains close to home today, but the mood is becoming much more peaceful. If there’s been restlessness in your living space or with family, you’ll find it easier to find common ground this afternoon. You are the architect of your own sanctuary. Focus on what makes you feel secure and settled. You’ve spent so much time building for the future; today, allow yourself to actually enjoy the home you’ve created. You deserve this comfort."
    },
    {
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, your mind is still buzzing with ideas, but today you have the ability to explain them in a way that truly connects with others. If you’ve felt misunderstood, try sharing your thoughts again this afternoon—people are more receptive now. Your voice has a calming authority today. Use it to build bridges or to help someone who is struggling with their own clarity. You are a natural teacher, and your perspective is the gift the world needs right now."
    },
    {
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, today is about honoring your worth in very practical ways. You’ve had the big visions, and now you’re figuring out how to make them sustainable. If you’ve been worried about money or resources, take a deep breath. A more grounded, stable energy is coming your way. You are learning to value your time and your energy just as much as your dreams. Trust that the universe provides for those who honor themselves. You are deserving of abundance and peace."
    }
]
