[
    {
        "script_text": "Aries, today’s Scorpio Moon invites you to look beneath the surface of your professional partnerships. With a powerhouse of planets in Capricorn, your career is entering a phase of intense transformation. Trust the gut feelings you get during meetings today. You are being asked to merge your bold ambition with a deeper level of strategy. Secure your resources, focus on the 'why' behind your goals, and let your intuition lead you to a major breakthrough by nightfall.",
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Taurus, the Scorpio Moon is highlighting your seventh house of partnerships today, demanding total honesty. As the Capricorn Sun and Mars support your long-term vision, you are finding that the right alliances are key to your success. Don't settle for surface-level agreements; dive deep into the details of your commitments. A breakthrough in a romantic or business relationship is likely if you lead with your heart. Trust the process of connection—true stability is built on transparency.",
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Gemini, productivity is your middle name today! The Scorpio Moon gives you a laser-like focus on your daily habits and health routines. While Mercury in Capricorn keeps your mind on big-picture goals, today is about the small, intense improvements that lead to massive results. Analyze your workflow and eliminate what isn't serving you. Your ability to solve complex problems is at an all-time high this afternoon. Stay disciplined, stay hydrated, and watch your efficiency soar to new heights.",
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Gemini.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Cancer, today is a day of deep creative and romantic resonance. With the Moon in fellow water sign Scorpio, your intuition and passions are perfectly aligned. The Capricorn energy across the sky is grounding your relationships, making this an ideal time for a serious conversation about the future. If you are an artist, your work today will have a powerful, magnetic quality. Don't be afraid to show the world your intensity. Your vulnerability is currently your greatest source of strength.",
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Cancer.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Leo, your focus remains on your home and inner emotional world today. The Scorpio Moon is asking you to heal a past wound or reinforce your family foundations. While your work life is demanding with the Capricorn stellium, the stars suggest that your true power today comes from your private life. Take a moment to declutter your personal space—it will clear your mind for the big professional moves you have planned for later this week. Trust your inner sanctuary.",
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Virgo, your mind is a powerful investigative tool today. The Scorpio Moon in your communication sector makes you the ultimate detective. Whether you are learning a new skill or negotiating a contract, you will see the truths that others miss. Use this edge to your advantage in your creative projects, which are highly favored by the Capricorn Sun. Speak with authority and don't be afraid to ask the hard questions. Your intellectual depth is your most valuable asset today.",
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Libra, today is all about your self-worth and financial strategy. The Scorpio Moon encourages you to take a deep look at your resources. Are you being compensated fairly for your intense efforts? With the Capricorn energy grounding your home and family life, you have the support needed to make a bold financial move. Don't rush into a purchase; instead, research the long-term value. Your intuition regarding money is incredibly sharp right now—listen to it and build your empire.",
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Libra.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Scorpio, the Moon is still in your sign today, and it’s forming a beautiful trine to Saturn. This is your moment of maximum influence. You have the emotional depth and the practical discipline to manifest a long-term dream. While others may feel overwhelmed by the intensity, you are in your element. Use this magnetic energy to lead a project or deepen a connection. You are the master of your fate today. Own your power, trust your gut, and lead.",
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Scorpio.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Sagittarius, the universe is guiding you through a period of quiet transformation. With the Moon in your 12th house, your subconscious is incredibly active. Use this day for spiritual practice or deep research. While your financial sector is busy with Capricorn planets, your best ideas will come during moments of solitude. Don't ignore a recurring dream or a sudden 'hunch' today. By retreating slightly, you are actually gaining the perspective needed to conquer your next big goal. Peace is power.",
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Sagittarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Capricorn, your social influence is peaking today! As the Scorpio Moon activates your 11th house of community, you are the person everyone wants to talk to. Your natural authority is softened by a touch of mystery, making you incredibly persuasive. This is the perfect day to pitch an idea or seek support for a cause you believe in. Align your personal ambitions with the needs of the group. When you help others win, your own victory becomes inevitable and lasting.",
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Capricorn.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Aquarius, the spotlight is on your career and your legacy today. The Scorpio Moon in your 10th house demands that you bring your full intensity to your professional goals. With the Capricorn energy working in your house of secrets, you may have an 'ace up your sleeve' that nobody expects. Use your strategic mind to navigate office politics and stay focused on the end game. A significant person in authority is noticing your depth and dedication—keep pushing for greatness.",
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aquarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Pisces, today your mind is expanding in powerful new directions. The Scorpio Moon forms a supportive trine to Saturn in your sign, giving you the discipline to turn a philosophical idea into a reality. Whether you are studying, traveling, or teaching, you are doing so with a level of depth that inspires others. Your social circles in Capricorn are providing the structure you need to succeed. Trust your vision, Pisces. You are building something meaningful that will stand the test of time.",
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Pisces.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    }
]
