[
    {
        "script_text": "Aries, as the Moon shifts into Scorpio today, your focus dives deep into shared resources and personal transformation. With the Sun and Mars fueling your career sector, you have the stamina to close a complex deal or uncover a hidden professional opportunity. Trust your investigative instincts—if something feels off, dig deeper. This isn't a day for surface-level talk. Harness your intensity to solve a long-standing mystery and watch your professional influence rise by sunset.",
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Taurus, the Moon moves into your opposite sign of Scorpio today, putting a powerful spotlight on your closest relationships. You may feel a pull toward deeper intimacy or a need to resolve a lingering conflict. While the Capricorn energy encourages you to look at the big picture, the Scorpio Moon demands emotional honesty. Don't shy away from the 'real' conversations. A moment of vulnerability today will strengthen your bonds more than any grand gesture ever could.",
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Gemini, your daily routine gets a dose of Scorpio intensity today. It’s the perfect time to declutter your workspace or dive into a research project that requires laser-like focus. With your ruler Mercury in Capricorn, your thinking is grounded and practical. Use this combination to tackle your most difficult tasks first. Pay close attention to your health and hydration today—your body is processing a lot of mental energy. Stay disciplined, and you'll end the day feeling incredibly productive.",
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Gemini.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY",
        "uploaded": true
    },
    {
        "script_text": "Cancer, the Moon enters fellow water sign Scorpio today, igniting your house of creativity, romance, and joy. After a few days of focusing on home life, the stars are giving you permission to express your passions. If you've been working on a creative project, a breakthrough is likely today. In romance, don't be afraid to show your deeper side. Your magnetic energy is high, attracting people who appreciate your authentic soul. Follow your heart—it knows the way.",
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Cancer.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY",
        "uploaded": true
    },
    {
        "script_text": "Leo, your focus shifts toward your inner sanctum today as the Moon moves into Scorpio. You may feel a strong urge to protect your privacy or spend quality time with family. While your work life is busy with the Capricorn stellium, your heart is calling you home. Use this energy to strengthen your emotional foundation. A conversation with a parent or elder could reveal a family secret or a piece of wisdom that helps you feel more secure.",
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Virgo, your words carry a heavy weight today as the Moon enters your communication sector. You have the ability to see right through people’s intentions, making it a brilliant day for negotiations or high-stakes meetings. The Capricorn Sun and Mars are supporting your creative self-expression, so don't be afraid to speak your truth with authority. Just remember to use your power wisely—a kind word can be just as transformative as a sharp one. Trust your intellect today.",
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Libra, after a busy few days with the Moon in your sign, the energy shifts toward your finances and personal values. The Scorpio Moon encourages you to take a hard look at your budget and your long-term security. With the Capricorn stellium grounding your home life, it’s a great day to make a major purchase or investment in your property. Don't settle for 'good enough'—look for quality and longevity. Your worth is increasing, so start acting like it.",
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Libra.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Scorpio, the Moon enters your sign today, amplifying your natural magnetism and intuition to an all-time high. You are in your element, and people can feel your quiet power. While the Capricorn stellium sharpens your communication, don't feel the need to reveal all your secrets just yet. Your silence is your greatest tool for negotiation today. Trust your first impression of someone new; your gut is rarely wrong. Own your space and lead with your soul today.",
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Scorpio.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Sagittarius, the universe is asking you to go within today as the Moon enters your 12th house of the subconscious. You might feel a bit more introverted than usual, and that is perfectly okay. Use this quiet energy to process the major career moves you've been making. Your intuition is shouting right now—pay attention to your dreams and gut feelings. A financial realization may come while you are in a quiet moment. Recharge your batteries; your season of action is coming.",
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Sagittarius.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Capricorn, you are the powerhouse of the zodiac right now, but today the Scorpio Moon shifts your focus toward your social circles and community. You are realizing that you don't have to climb the mountain alone. Reach out to a mentor or a group of like-minded peers who share your vision. A collaborative effort today could lead to a major breakthrough in your long-term goals. Your influence is at a peak—use it to inspire others while you secure your legacy.",
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Capricorn.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Aquarius, the Moon enters your career sector today, bringing intensity and focus to your professional life. You are being called to step into a leadership role or complete a high-stakes project. With the Capricorn energy working behind the scenes, you have the secret wisdom needed to succeed. Don't worry about the public's opinion—focus on the results. A supervisor or person of authority is watching you closely today; show them your depth and your dedication to the long game.",
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aquarius.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    },
    {
        "script_text": "Pisces, your perspective is expanding today as the Moon moves into fellow water sign Scorpio. You are craving deep wisdom and new experiences. It’s a brilliant day for study, teaching, or spiritual exploration. With the Capricorn stellium supporting your social life, a friend might introduce you to a philosophy or travel opportunity that changes your world-view. Trust your intuition when it comes to long-distance matters. You are evolving, Pisces—allow yourself to dream bigger than ever before.",
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Pisces.jpg"
        ],
        "active": true,
        "status": "done",
        "date": "TODAY"
    }
]