[
    {
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, as the Moon glides into Pisces today, your world gets a little quieter. I know you’re ready to sprint into the new Aquarius season, but your soul needs a moment to catch its breath. Trust the tug toward solitude. You aren't losing your edge; you’re sharpening your intuition. Pay attention to your dreams tonight. They aren't just shadows; they are messages from your heart about where you’re headed next. Be gentle with your fire today."
    },
    {
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, today the Pisces Moon brings a wave of kindness to your social circles. You’ve been working so hard to build your future, but today reminds you that you don't have to be the only pillar of strength. Reach out to a friend who feels like home. I see you finding deep comfort in shared dreams and quiet laughter. Let yourself be supported. You are realizing that the most valuable thing you own isn't something you can buy—it’s the love you share."
    },
    {
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, today your career path is illuminated by a softer, more intuitive light. If you’ve been overthinking your professional moves, the Pisces Moon asks you to simply 'feel' the right direction. You don't need a spreadsheet to know when a project has heart. Trust your gut during meetings today. Your empathy is actually your greatest professional asset right now. You aren't just working for a paycheck; you are working for a purpose. Listen to that inner calling."
    },
    {
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, the Moon enters fellow water sign Pisces today, and it feels like a spiritual homecoming for you. Your horizons are expanding, not through logic, but through faith. If you’ve felt a bit restricted lately, today provides the emotional freedom you’ve been craving. Seek out beauty—whether it’s in art, nature, or a deep conversation. You are remembering that you are part of something much bigger than your daily worries. Trust the flow of the universe; it’s carrying you home."
    },
    {
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, you’re diving into deep emotional waters today as the Moon moves into Pisces. This is a day for healing the parts of yourself that you usually hide. I know you love to be the source of light, but it’s okay to sit in the shade and process your deeper feelings. You are transforming old fears into new wisdom. A moment of true vulnerability with a loved one could break down walls you’ve been building for years. You are safe to let go."
    },
    {
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, today the Pisces Moon shines directly into your house of partnerships. Your focus is on the people who make your life meaningful. I know you love to show love through service and logic, but today, try showing it through pure, unfiltered presence. See the magic in the people around you, flaws and all. You are realizing that perfection isn't necessary for a deep connection. Open your heart to the messy, beautiful reality of love. You are deeply appreciated."
    },
    {
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, your daily routine gets a dose of magic today. The Pisces Moon encourages you to find the sacred in the mundane. Whether it’s how you make your coffee or how you talk to yourself, bring a little more compassion to your habits. If you’ve been feeling physically drained, this is the universe telling you to nourish your spirit alongside your body. Listen to what your heart needs to feel balanced. You don’t have to do it all perfectly; you just have to do it with love."
    },
    {
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, you are in your element today as the Moon moves into fellow water sign Pisces. Your creativity and romantic spirit are overflowing. After a few days of intense communication, today is for pure expression. Paint, write, dance, or simply share your heart with someone special. Your magnetic energy is high, but it’s a gentle, inviting power today. Trust the joy you feel—it’s not a distraction, it’s a sign that you are living in alignment with your soul’s purpose."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, your focus turns toward your inner sanctuary today. The Pisces Moon is asking you to find peace within your home and your roots. I know you’re always looking toward the next horizon, but today the most important journey is the one that leads back to your own heart. Forgive a family member, or perhaps forgive yourself for a past version of you. You are building a foundation of emotional security that will allow you to fly even higher tomorrow. Rest easy."
    },
    {
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, your words are infused with a special kind of empathy today. The Pisces Moon in your communication sector helps you say the things that are usually hard for you to express. You are seeing the 'unspoken' truths in your interactions. Use this gift to heal a misunderstanding or to encourage someone who is struggling. You don’t always have to be the authority figure; today, be the listener. Your kindness is the most powerful tool in your kit right now. Speak from the heart."
    },
    {
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, as the Sun shines in your sign, the Pisces Moon asks you to ground your visionary ideas in your personal values. It’s a day for reflecting on what truly matters to you. I know you’re focused on the future, but make sure that future includes your own peace and security. You are worthy of the abundance you’re working so hard for. Trust your intuition regarding a financial matter today. You are manifesting a life that is both innovative and deeply soul-satisfying."
    },
    {
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, the Moon has come home to your sign, and your heart is open wide. You may feel more sensitive than usual, but please know that this sensitivity is your superpower. You are the emotional healer of the zodiac today. Trust your instincts and allow yourself to dream without limits. If you feel overwhelmed, find peace near water or music. You are a masterpiece of light and shadow, and today, the world is finally vibrating at your frequency. You are exactly where you belong."
    }
]
