[
    {
        "title": "Aries Daily Horoscope ♈ - January 26, 2026",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, the slow pace of the weekend is fading, and your mind is starting to race ahead. As the Moon moves into Gemini, you’ll find yourself craving connection and new information. If you’ve felt a bit stagnant, today is the day the engines restart. Use this mental spark to reach out to someone you haven't spoken to in a while. Your words have a special power to motivate others today. Just remember to take a breath between ideas—your fire is bright, but don't let it scatter."
    },
    {
        "title": "Taurus Daily Horoscope ♉ - January 26, 2026",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, enjoy the quiet of the morning while it lasts. As the Moon leaves your sign later today, the focus shifts to your resources and your values. I know you prefer a steady pace, but the world might feel a little noisier than usual this afternoon. Don't let the rush of others disturb your peace. You are figuring out how to turn your recent rest into practical results. Trust your worth, stay grounded in your senses, and remember that you set the tempo for your own life."
    },
    {
        "title": "Gemini Daily Horoscope ♊ - January 26, 2026",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, the spotlight is turning your way! As the Moon enters your sign today, you’ll feel a surge of vitality and a deep need to be heard. After a few days of quiet reflection, your wit and charm are back in full force. I see you connecting dots that others miss. Use this energy to share your vision, but be gentle with those who aren't moving quite as fast as you are. Your curiosity is your superpower today—follow it wherever it leads. You are exactly where you need to be."
    },
    {
        "title": "Cancer Daily Horoscope ♋ - January 26, 2026",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, as the world speeds up today, you might feel a pull to step into the background. With the Moon moving into your sector of the subconscious, your inner world is becoming much more interesting than the outer one. I know it’s Monday, but if you can, find pockets of silence. Your intuition is shouting today—listen to it. You are processing deep realizations that will help you move forward with more clarity later this week. Trust the quiet; it’s where your magic lives."
    },
    {
        "title": "Leo Daily Horoscope ♌ - January 26, 2026",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, your social circles are buzzing today! The transition into the Gemini Moon brings a fresh breeze to your friendships and your hopes for the future. If you’ve been working solo, today is the day to collaborate. I see you finding a lot of joy in group settings or community projects. Your light is meant to be shared. Don't be afraid to voice your more 'out of the box' ideas—the Aquarius Sun is supporting your most innovative side. You are the heart of your tribe today."
    },
    {
        "title": "Virgo Daily Horoscope ♍ - January 26, 2026",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, your career and your reputation are taking center stage today. As the Moon moves to the top of your chart, people are looking to you for clarity and direction. I know you can be modest, but today it’s okay to acknowledge your expertise. You have a way of explaining complex things that makes everyone feel more secure. Use your words to build bridges at work. Your dedication is being noticed, even if you think you’re just 'doing your job.' Step into your authority with grace."
    },
    {
        "title": "Libra Daily Horoscope ♎ - January 26, 2026",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, your mind is craving expansion today. The Gemini Moon is lighting up your house of wisdom and adventure, making you feel a bit restless with the status quo. If you can’t travel physically, travel through a book, a podcast, or a deep philosophical debate. You are looking for the 'why' behind the 'what' today. Trust your hunger for more meaning. You are breaking out of old mental loops and seeing the world from a much higher perspective. Your horizon is growing."
    },
    {
        "title": "Scorpio Daily Horoscope ♏ - January 26, 2026",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, the energy turns inward and deepens today. While everyone else is busy chatting, you are looking beneath the surface. The Gemini Moon in your eighth house brings a sharp focus to your psychological patterns and your shared secrets. If an old memory surfaces, look at it with curiosity rather than judgment. You are learning to talk about the things that usually stay hidden. This honesty is the key to your transformation. You are becoming more powerful by being more real."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐ - January 26, 2026",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, the focus is squarely on your relationships today. As the Moon moves into your opposite sign, Gemini, you’ll find that the best way to understand yourself is through a conversation with someone else. I know you value your independence, but today there is a beautiful synergy in partnership. Listen as much as you speak. You might hear exactly what you’ve been trying to tell yourself, but from a different voice. Connection is your greatest teacher today. Open up."
    },
    {
        "title": "Capricorn Daily Horoscope ♑ - January 26, 2026",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, it’s time to tackle the details. The Gemini Moon is energizing your daily routines and your health sector. After a weekend of resting, your mind is ready to organize and optimize. I know you have big mountains to climb, but today is about the small steps. Make the lists, clear the emails, and check in with your body. You’ll find a surprising amount of satisfaction in being efficient today. Your future success is being built in these quiet, disciplined moments. Keep going."
    },
    {
        "title": "Aquarius Daily Horoscope ♒ - January 26, 2026",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, the joy is returning! With the Sun in your sign and the Moon moving into fellow air sign Gemini, your creative fire is being stoked. If you’ve felt a bit heavy or serious, today is for lightness and expression. Follow your heart toward whatever makes you lose track of time. Whether it’s a romantic spark or a creative breakthrough, let yourself play. You don't have to be the world-changer every second. Today, just be the person who enjoys being alive. Your happiness is infectious."
    },
    {
        "title": "Pisces Daily Horoscope ♓ - January 26, 2026",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, your focus turns toward your roots and your inner sanctuary today. As the Moon moves into Gemini, you might find yourself wanting to talk through some old family stories or home-based plans. I know you feel things deeply, and today you have the words to describe those feelings. Use this energy to clear the air in your living space. You are building a stronger emotional foundation for yourself. Trust the process of settling in. Your heart is finding its way home."
    }
]
