[
    {
        "title": "Aries Daily Horoscope ♈ - January 28, 2026",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, the world is asking you to soften your pace today. As the Moon enters Cancer, your focus shifts toward your home and your inner foundation. I know you’re used to outward victories, but today’s win is found in emotional security. If you feel a bit more sensitive to criticism, take it as a sign to retreat to your sanctuary. You don't have to fight every battle. Sometimes, the most courageous thing you can do is admit you need a little comfort."
    },
    {
        "title": "Taurus Daily Horoscope ♉ - January 28, 2026",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, your words are gaining a deeper, more soulful quality today. With the Moon moving into your communication sector, you’re finding it easier to speak from the heart rather than just the facts. If you’ve had something on your mind, share it with someone you trust. You’ll find that people are remarkably receptive to your vulnerability right now. Trust your gut instincts in conversations—your intuition is currently your best advisor. Connect with a sibling or neighbor for a grounded chat."
    },
    {
        "title": "Gemini Daily Horoscope ♊ - January 28, 2026",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, the mental whirlwind of the last few days is finally settling down. As the Moon leaves your sign and enters Cancer, your focus moves toward what you truly value. It’s a day to ground your big ideas into something tangible. How do your goals actually make you *feel*? If you’ve been overspending your energy lately, today is the day to budget it wisely. Treat yourself to something that makes you feel secure and nourished. You’ve earned a moment of stability."
    },
    {
        "title": "Cancer Daily Horoscope ♋ - January 28, 2026",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, the Moon has come home to your sign, and your emotional batteries are finally recharging. You might feel more 'in tune' with the world around you, but remember that your sensitivity is a superpower, not a burden. Today is for you. Prioritize your own needs and let the world wait. If you feel like having a good cry or a long nap, honor that. You are clearing space for new growth. Trust your heart; it knows exactly where you need to go next."
    },
    {
        "title": "Leo Daily Horoscope ♌ - January 28, 2026",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, while the Sun in your opposite sign keeps you focused on others, the Cancer Moon is inviting you to go within. This is a deeply spiritual and reflective day for you. If you feel a bit drained by the social demands of the week, give yourself permission to unplug. Your subconscious is trying to tell you something important through your dreams or quiet moments. You don't need to be the center of attention today. Your power is growing in the silence."
    },
    {
        "title": "Virgo Daily Horoscope ♍ - January 28, 2026",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, today is about finding your true tribe. The Cancer Moon is highlighting your friendships and your sense of belonging. You often show love by helping, but today, allow others to help you. A heartfelt conversation with a friend could provide the emotional support you didn't even realize you needed. You are part of a community that values your heart just as much as your hard work. Lean into that connection—it’s what makes the big goals worth chasing."
    },
    {
        "title": "Libra Daily Horoscope ♎ - January 28, 2026",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, your professional world is calling for a touch of empathy today. As the Moon moves to the top of your chart, you may find that your intuition is your best tool for success. Don't just look at the numbers; look at the people involved. Your ability to nurture a project or a team is what will make you stand out. If you’re feeling the pressure of public expectations, ground yourself in your private values. You are leading with grace, and people are noticing."
    },
    {
        "title": "Scorpio Daily Horoscope ♏ - January 28, 2026",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, the Cancer Moon is a welcome friend to your fellow water sign heart. Today, your horizons are expanding through a deep sense of faith and intuition. If you’ve been feeling stuck in a mental loop, this energy helps you see the bigger, more spiritual picture. Seek out something that inspires you—a piece of music, a philosophy, or a walk by the water. You are remembering that your journey isn't just about reaching a destination; it's about how much you grow along the way."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐ - January 28, 2026",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, today the energy turns deep and transformational. I know you love the open road, but the Cancer Moon is asking you to explore your internal landscape. You might find yourself reflecting on deep bonds or shared resources. If an old emotion resurfaces, don't run from it—nurture it. You are healing a part of yourself that has been waiting for your attention. This 'inner work' is what will eventually give you the strength to fly even further. Trust the depth."
    },
    {
        "title": "Capricorn Daily Horoscope ♑ - January 28, 2026",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, the focus is squarely on your closest relationships today. With the Moon in your opposite sign, you are seeing the world through the eyes of those you love. If you’ve been a bit too focused on your own goals, today is the day for a 'heart-to-heart.' Be receptive to the emotions of others, even if they seem illogical to your practical mind. Your strength is needed as a support system today, but don't forget to let them support you, too. Love is a two-way street."
    },
    {
        "title": "Aquarius Daily Horoscope ♒ - January 28, 2026",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, even a visionary like you has to check in with their body. The Cancer Moon is highlighting your daily routines and your well-being. If you’ve been living in your head lately, come back down to your physical self. What does your body need to feel 'cared for'? A home-cooked meal, a gentle stretch, or an early night could work wonders for your clarity. You are realizing that your big ideas for the future are only as sustainable as the health of the person dreaming them."
    },
    {
        "title": "Pisces Daily Horoscope ♓ - January 28, 2026",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, today feels like a warm embrace from the universe. With the Moon in fellow water sign Cancer, your creative and romantic spirit is flowing freely. This is a day to express your heart without fear. Whether it’s through a hobby, a romance, or time with children, let your joy be your guide. You are finding that the more you allow yourself to be vulnerable, the more magic you attract. Trust the beauty you see in the world today—it’s a reflection of the beauty in you."
    }
]
