[
    {
        "script_text": "Aries, today’s Last Quarter Moon in Libra asks you to release a partnership dynamic that no longer serves your growth. As the Sun and Mars continue to fire up your career sector, you are being called to lead with authority. However, with Jupiter at opposition today, a new way of communicating your ideas could open a massive door. Don't be afraid to change your mind if it means expanding your reach. Balance your drive with a little diplomacy tonight.",
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aries.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Taurus, with your ruler Venus in adventurous Sagittarius and Jupiter at opposition today, you are feeling a pull toward the unknown. It’s a brilliant day for learning or planning a significant trip. In your professional life, the Capricorn energy demands focus on the fine details. Don't let a minor setback in your routine dampen your spirit; it’s merely the universe asking for a course correction. Trust that your financial stability is being reinforced by your recent disciplined choices.",
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Taurus.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Gemini, today is one of your most powerful days of the year! Jupiter reaches opposition in your sign, acting like a cosmic spotlight on your personal identity and goals. You are at a peak of visibility, making this the perfect moment to share your vision with the world. While the energy is high, the Libra Moon reminds you to keep your creative projects balanced. Don't over-promise; instead, use your natural charm to gather the support you need for your next big move.",
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Gemini.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Cancer, today is about deep internal growth as Jupiter at opposition illuminates your subconscious sector. You may find that a secret or a hidden truth finally makes sense. In your outer world, the Capricorn Sun and Mars are putting the focus on your one-on-one relationships. If there’s tension, use the diplomatic energy of the Libra Moon to find common ground. It’s a day for releasing old emotional baggage to make room for a more powerful, structured future with your partners.",
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Cancer.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Leo, your social circles are expanding today thanks to the Jupiter opposition in your 11th house. This is a prime day for networking or collaborating on a big project. At the same time, the Capricorn stellium is keeping your nose to the grindstone regarding your daily health and work habits. Don't let the excitement of new connections distract you from your self-care. A balanced approach—focusing on your duties during the day and socializing tonight—will bring the most fulfillment and success.",
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Leo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Virgo, career recognition is likely today as Jupiter reaches opposition at the top of your chart. Your hard work is being noticed by those in power. However, the Libra Moon suggests you need to re-evaluate your finances or personal values before making your next big investment. Stay practical—your sign’s specialty. Use the Mars energy in Capricorn to inject some creativity into your work. A bold move made with precision will set you apart from the crowd this evening.",
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Virgo.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Libra, with the Last Quarter Moon in your sign, today is a day for personal reflection and letting go. You are clearing out the old to make way for a major breakthrough in your belief systems or travel plans. Jupiter at opposition is opening your mind to new philosophies—listen to what the universe is teaching you. At home, the Capricorn energy asks for structure and boundaries. Focus on your foundation tonight; the peace you create now will fuel your success tomorrow.",
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Libra.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Scorpio, your intuition is razor-sharp today. As Jupiter reaches opposition in your sector of shared resources, a financial or deep emotional matter may reach a turning point. Use this clarity to negotiate or finalize an agreement. Your communication is boosted by the Capricorn stellium, making you a persuasive force in meetings or daily chats. Don't be afraid to dig deep for the truth—it is your greatest ally. A quiet evening of meditation will help you process these intense revelations.",
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Scorpio.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Sagittarius, your ruling planet Jupiter is at opposition today, bringing a massive focus to your relationships! A partnership—whether romantic or professional—is reaching a significant peak. This is the time to be honest about your needs and listen to theirs. Financially, the Capricorn Sun and Mars are helping you build a very solid foundation. Stay disciplined with your spending, but allow yourself to dream big about your long-term security. The balance between freedom and commitment is your key to success today.",
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Sagittarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Capricorn, with the Sun, Mars, and Mercury in your sign, you are the architect of your own destiny right now. Today, the Jupiter opposition highlights your sector of health and service, suggesting that a small change in your routine could lead to a big increase in energy. Use the Libra Moon to smooth over any tensions with family or housemates. You are being pushed to lead, but leading with empathy will bring much better results. Success is coming through your consistent, disciplined effort.",
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Capricorn.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Aquarius, today is a day for creative explosion! Jupiter reaches opposition in your 5th house of joy and romance, making this a brilliant time for self-expression. Whether it’s a new hobby or a romantic spark, lean into the fun. However, the Capricorn stellium is active in your 12th house, reminding you to keep some of your best ideas behind the scenes for now. Protect your energy and avoid oversharing. Your intuition is guiding you toward a major personal transformation—trust the quiet voice within.",
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Aquarius.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    },
    {
        "script_text": "Pisces, your focus today is on home and family as Jupiter reaches opposition in your 4th house. A domestic project or family situation reaches a turning point—look for the expansion and growth hidden in the challenge. Socially, the Capricorn energy is helping you connect with influential people who share your long-term goals. The Libra Moon asks you to release an old emotional habit that keeps you from being fully present. Balance your public ambitions with your private needs for the best results today.",
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "images": [
            "assets/zodiac_signs/Pisces.jpg"
        ],
        "active": true,
        "status": "pending",
        "date": "TODAY"
    }
]
