[
    {
        "title": "Aries Daily Horoscope ♈",
        "target": "ARIES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aries, the Moon has finally come home to your sign, and I know you can feel the electricity in the air! After a few days of feeling a bit lost in the fog, your spark is back. This is your cosmic green light. Don’t worry about having a perfect plan; just follow the impulse to move. Your courage is contagious today. Trust yourself, take that first step, and remember—the world has been waiting for your fire."
    },
    {
        "title": "Taurus Daily Horoscope ♉",
        "target": "TAURUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Taurus, as the Moon moves into Aries, it’s lighting up the most private part of your chart. While the world feels like it’s speeding up, you might feel a pull toward solitude. I know you hate to be rushed, so give yourself permission to move at your own pace. You are preparing for a major breakthrough behind the scenes. Trust the quiet work you're doing. Your strength doesn't always have to be loud to be powerful."
    },
    {
        "title": "Gemini Daily Horoscope ♊",
        "target": "GEMINI",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Gemini, today is all about your tribe! The Aries Moon is energizing your social circles and your big dreams. If you’ve been sitting on a visionary idea, today is the day to share it with friends who truly 'get' you. I see you finding a sudden surge of hope for the future. You don't have to do it alone—lean into the collective energy of your community. Your voice is the spark that starts a beautiful fire today."
    },
    {
        "title": "Cancer Daily Horoscope ♋",
        "target": "CANCER",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Cancer, the spotlight is shifting toward your career and public life today. I know you often prefer the comfort of the shadows, but the Aries Moon is asking you to lead with your heart. You have a unique ability to bring emotional intelligence into professional spaces. Don't be afraid to take charge of a project or share your vision. You are more capable than you feel right now. Step forward with confidence—you’ve earned this moment in the sun."
    },
    {
        "title": "Leo Daily Horoscope ♌",
        "target": "LEO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Leo, your spirit is craving adventure today! With the Moon in fellow fire sign Aries, you are finally breaking free from the heavy routines of the last few weeks. I see you looking toward the horizon with a new sense of purpose. Whether it’s learning something new or planning a trip, follow the call of your wild heart. You aren't meant to stay in one place. Your wisdom is growing, and today, the world feels limitless again."
    },
    {
        "title": "Virgo Daily Horoscope ♍",
        "target": "VIRGO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Virgo, today's energy is deep and incredibly transformative. The Aries Moon is asking you to look at your shared resources and your most intimate bonds. I know you like to have everything in its place, but today is about the messy, beautiful work of deep connection. Don't be afraid to ask for what you need or to face a difficult truth. You are building a stronger, more honest foundation for your future. Trust the process of healing."
    },
    {
        "title": "Libra Daily Horoscope ♎",
        "target": "LIBRA",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Libra, the focus shifts directly to your relationships today. As the Moon enters your opposite sign, Aries, you might feel a bit of a tug-of-war between your needs and someone else’s. I know you love harmony, but sometimes a little friction is necessary for growth. Be bold in your communication. Don't be afraid to stand up for yourself. True balance isn't just about making others happy—it's about making sure your own heart is heard, too."
    },
    {
        "title": "Scorpio Daily Horoscope ♏",
        "target": "SCORPIO",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Scorpio, it’s time to get your hands dirty! The Aries Moon is energizing your daily habits and your health routines. If you’ve been feeling stagnant, today is the perfect day to start a new rhythm. I know you have big dreams, but those dreams are built in the small, daily choices you make. Take a bold step toward a healthier version of you. You have the discipline and the drive to make a lasting change today."
    },
    {
        "title": "Sagittarius Daily Horoscope ♐",
        "target": "SAGITTARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Sagittarius, joy is your priority today! The Moon moves into fellow fire sign Aries, lighting up your house of romance and creativity. I know life has felt a bit serious lately, but today the universe is giving you permission to play. Follow a creative spark, go on a date, or just do something that makes you laugh. Your magnetic energy is at an all-time high. Don't overthink it—just let your heart lead the way to fun."
    },
    {
        "title": "Capricorn Daily Horoscope ♑",
        "target": "CAPRICORN",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Capricorn, your focus turns toward your inner world today. The Aries Moon is asking you to bring some of that famous drive of yours into your home life. I know you’re used to conquering mountains, but today the most important work is within your own four walls. Heal a family wound or tackle a domestic project that’s been on your mind. You are building a sanctuary that truly supports the powerhouse you’re becoming. Peace begins at home."
    },
    {
        "title": "Aquarius Daily Horoscope ♒",
        "target": "AQUARIUS",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Aquarius, your mind is on fire today—in the best way possible! With the Sun in your sign and the Moon in Aries, your communication skills are sharp and persuasive. I know you have a vision for the future, and today is the day to put words to that vision. Share your ideas with neighbors, siblings, or your local community. You are the spark of innovation the world needs right now. Speak up; your message is exactly what someone needs to hear."
    },
    {
        "title": "Pisces Daily Horoscope ♓",
        "target": "PISCES",
        "type": "daily",
        "date": "TODAY",
        "active": true,
        "status": "pending",
        "script_text": "Pisces, as the Moon leaves your sign and enters Aries, it’s time to ground those beautiful dreams of yours. Today is about your self-worth and your resources. I know you live in the world of imagination, but today the universe asks: how can you make your dreams pay the bills? Take a practical step toward financial security. You are realizing that you are worthy of abundance. Trust your value and don't be afraid to ask for what you deserve."
    }
]
