[
    {
        "script_text": "Aries, the Cosmic Gateways of 2026 swing open, and your destiny is rewriting itself. The Giants are moving. Pluto, the Lord of Transformation, makes its historic entry into Aquarius this very year. Your fame, your legacy, your public throne... Pluto is revolutionizing your 10th House of Career. This isn't just a promotion, Aries. This is a total reinvention of your authority. The old structures of power are crumbling to make room for your authentic, revolutionary voice. You are destined to lead the collective. The age of the lone warrior is over; you are stepping into the age of the visionary leader. Don't fear the power you are about to claim. The universe didn't bring you this far to leave you in the shadows. Stand in the light. Your legacy begins now.",
        "title": "Aries 2026: Pluto's Career Revolution",
        "target": "ARIES",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/ARIES.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Aries: The Year Your Life CRUMBLES (2026 Horoscope) #shorts",
        "youtube_description": "Aries, are you ready for the total career reinvention coming in 2026? Pluto is rewriting your legacy in the Aquarius era.\n\nWhat are you releasing to make space for this new power? Let us know in the comments! #arieshoroscope #plutoinaquarius #2026predictions #zodiac",
        "youtube_tags": [
            "aries",
            "aries horoscope 2026",
            "2026 horoscope",
            "pluto in aquarius",
            "astrology",
            "zodiac",
            "manifestation",
            "law of attraction",
            "career prediction",
            "spiritual awakening",
            "numerology",
            "weekly horoscope",
            "monthly horoscope",
            "aries tarot",
            "future prediction",
            "trending",
            "viral",
            "fyp",
            "foryou",
            "foryoupage",
            "shorts"
        ]
    },
    {
        "script_text": "Are you ready for a cosmic transformation? In 2026, Taurus, you enter a new era where Pluto, the archetype of endings and rebirth, moves into Aquarius—a planet of rebellion and revolution. This shift profoundly invigorates your 10th House of Career, promising a year of radical change and upending long-standing achievement routes. As Neptune, the dreamer, assembles with Uranus, the visionary, in the realm of Pisces and Aries, mystical alliances and intuitive breakthroughs will unite your ambition with groundbreaking creativity. The theme of 2026: your divinity manifests through sustainable evolution, turning vision into lasting impact. Embrace this power—your destiny is rewriting itself.",
        "title": "2026 Taurus Divine Revolution",
        "target": "TAURUS",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/TAURUS.jpg"
        ],
        "active": true,
        "status": "pending",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "TAURUS Destiny Upgraded 2026: Pluto in Aquarius Sparks Unstoppable Change #shorts",
        "youtube_description": "Will you break free from old limits and claim new heights in 2026? Taurus, join the revolution! Revealed: achievable goals, hidden alliances, and soul-renewing opportunities. Comment below your biggest fears or expectations—your cosmic number is on the rise! #cosmic2026 #astrology #TAURUS #transit",
        "youtube_tags": [
            "#shorts",
            "#astrology",
            "#Taurus",
            "#horoscope",
            "#2026predictions",
            "#Pluto",
            "#Neptune",
            "#Uranus",
            "#reading",
            "#transits",
            "#manifestation",
            "#career",
            "#spirituality",
            "#mystic",
            "#crystalballs",
            "#zodiac",
            "#dreams",
            "#visionary",
            "# destiny"
        ]
    },
    {
        "script_text": "Geminis, prepare for 2026's transformative journey! Key events are brewing beneath the surface. Pluto’s year-long transit into Aquarius will profoundly ignite your 10th house, reshaping your career path into one of catalytic evolution and higher purpose. Neptune, glowing in yourILE, subtly seeps change into your creative sphere, blurring boundaries between reality and inspiration. Meanwhile, chaotic yet creative Uranus moves through Pisces, sparking moments of serendipity and unexpected connections. This is the year of profound awakening—highlighting personal growth journeys, expanded consciousness, and a redefinition of legacy. Those who embrace the flux will discover hidden strengths and unleashed potential. Trust the cosmic dance, for answers reveal themselves to the mystically attuned.",
        "title": "2026 Gemini Predicted: Uranus, Neptune, Pluto’s Cosmic Shake-Up!",
        "target": "GEMINI",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/GEMINI.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "2026 Gemini Destiny: Pluto Hits Aquarius! Big Career plus Cosmic Luck! #shorts",
        "youtube_description": "2026 holds cosmic fireworks for GEMINIs. Are you ready to transform your legacy? Neptune and Uranus dancing in your skies—what hidden truths await you? Drop comments predictions below! #Gemini2026 #CosmicAwakening #Astrology",
        "youtube_tags": [
            "#GeminiAstrology",
            "#2026Horoscope",
            "#Gemini",
            "#AstrologyShorts",
            "#Uranus",
            "#Neptune",
            "#Pluto",
            "#ZodiacPredictions",
            "#FutureTrends",
            "#SpiritualAwakening",
            "#PersonalGrowth",
            "#CelestialEvents",
            "#Destiny",
            "#Cosmic",
            "#Shorts",
            "#AstrologyViral",
            "#NowYouSeeIt",
            "#The Mystical",
            "shorts",
            "viral",
            "astrology",
            "gemini"
        ]
    },
    {
        "script_text": "Cancer, 2026 is not a year of small shifts; it is a cosmic rebirth. I am looking into the Akashic Records now, and the energy is deafening. The slow-moving giants are rewriting your destiny.\n\nFirst, Pluto’s move into Aquarius revolutionizes your 10th House of Career. This is the death of the 'old you' in the public eye. Expect a total power shift. If you’ve felt stuck, the universe is about to demolish your ceiling. You are stepping into a role of authority you didn't think possible.\n\nSimultaneously, Neptune dissolves boundaries in your sector of spiritual purpose, while Uranus electrifies your subconscious. The theme is 'Radical Reconstruction.' You are not just changing jobs; you are changing your entire vibration. The records show a profound alignment between your deepest hidden power and your public legacy. Do not fear the destruction; it is clearing the path for your empire. The old world is vanishing; step into the new one.",
        "title": "Cancer 2026: Pluto's Career Revolution",
        "target": "CANCER",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/CANCER.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "PLUTO is DESTROYING Your Career in 2026 #shorts",
        "youtube_description": "Cancer, are you ready for the death and rebirth of your career? Pluto in Aquarius is bringing a total power shift to your 10th House. The old structures are falling away to make room for your true legacy.\n\nWhat major career change are you anticipating this year? Tell me in the comments below! 👇\n\n#Cancer #Astrology #2026Horoscope #PlutoTransit",
        "youtube_tags": [
            "astrology",
            "cancer",
            "cancer horoscope 2026",
            "pluto in aquarius",
            "career astrology",
            "manifestation",
            "spiritual awakening",
            "zodiac signs",
            "horoscope",
            "akashic records",
            "2026 predictions",
            "life changing",
            "astrology reading",
            "viral shorts",
            "trending now",
            "success mindset",
            "astrology tiktok",
            "zodiac",
            "shorts",
            "viral"
        ]
    },
    {
        "script_text": "This year, Leo, the Earth-shifting energy of Pluto is entering your career sector—it will shake up your work identity and empower you to redefine your legacy. Uranus’s influence brings sudden, innovative changes that could launch you into uncharted territory or awaken new passions. Neptune’s mystical pull helps bridge soul and practicality, offering both clarity and mystery in your public and personal life. Expect unprecedented transformation that tests your boundaries but ultimately reveals your true purpose. This is the year to embrace change, trust your intuition, and claim your cosmic authority. Destiny is redefining you—let it unfold.",
        "title": "2026 Leo: Break Through, Rise Into Power",
        "target": "LEO",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/LEO.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "2026 LEO Destiny REVEALED! Pluto, Uranus, Neptune Change Everything #shorts",
        "youtube_description": "Want to know if your 2026 path is about change or cosmic breakthroughs? Watch now to discover how your legacy is being rewritten. Which planetary transit will revolutionize YOUR life in 2026?",
        "youtube_tags": [
            "#astrology",
            "#LEO2026",
            "#star预言",
            "#horoscopepredictions",
            "#manifestation2026",
            "#zodiac2026",
            "# Leo",
            "#astrologyshorts",
            "#shorts",
            "#宇宙预言",
            "#命运转折",
            "#天王星",
            "#冥王星",
            "#海王星影响",
            "#命理",
            "#星盘秘术",
            "shorts",
            "viral",
            "astrology",
            "leo"
        ]
    },
    {
        "script_text": "Astrologers, your time has come! The transits for Virgo in 2026 are extraordinary, with Pluto, Neptune, and Uranus moving into powerful positions. This year’s theme is transformation—a seismic shift affecting every core area of your life. Pluto’s move into Aquarius will revolutionize your 10th House, shaking up your career path, reputation, and ambitions in ways you never anticipated. Neptune’s influence brings heightened intuition and spirituality, encouraging you to trust your guidance and embrace the unknown. Uranus brings sudden shifts and unexpected opportunities, urging you to break free from habit. Always remember: transformation is painful at first, but it leads to profound growth.",
        "title": "2026 VIRGO Full Astrologic Forecast!",
        "target": "VIRGO",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/VIRGO.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Is VIRGO’s Destiny Changing? Pluto Into Aquarius Shock in 2026! 「You MUST SEE」 #shorts",
        "youtube_description": "How will 2026 change your career, love and intuition? Virgo, brace for cosmic transformation!",
        "youtube_tags": [
            "#astrology",
            "#VIRGO",
            "#horoscope",
            "#2026astrology",
            "#transits",
            "#futurecoding",
            "#spirituality",
            "#selfgrowth",
            "#careeradvice",
            "#destiny",
            "#newbeginnings",
            "#manifestation",
            "#mindset",
            "# astrology_predictions",
            "#giantplanets",
            "#signsofstrength",
            "#dailyreadings",
            "#2026horoscope",
            "#حرف",
            "#AstroNews",
            "shorts",
            "viral",
            "astrology",
            "virgo"
        ]
    },
    {
        "script_text": "Libra, this coming year is your moment of cosmic rebirth. Pluto, the god of transformation, is sweeping boldly into Aquarius. Its touch in your 10th House revolutionizes your career, awakening hidden talents and synchronizing material find with true purpose. Neptune ascends ruler of the Ascendant, deepening your intuition and dissolving boundaries—trust your inner vision. Uranus flares in Scorpio, sparking radical shifts from uncertainty to breakthrough. This is the year to step beyond routine. Everything is shifting—break patterns, embrace fifth-estate progress, and lead with fresh wisdom. Trust your evolution; all paths are yours to create.",
        "title": "LIBRA, 2026 is Your Cosmic Awakening! 🌌✨",
        "target": "LIBRA",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/LIBRA.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "LIBRA Destiny Revealed! 2026 Pluto, Uranus, Neptune—massive changes are coming! #shorts",
        "youtube_description": "Is your career about to defy destiny? Neptune’s inner wisdom and Uranus’ explosive energy await you. Pluto’s energy will transform your path. WILL YOU TRUST YOUR INTUITION THIS YEAR? Comment below your dreams and fears! 🔮💖 #2026Astrology #LIBRA #Transformation #mysticalhoroscope",
        "youtube_tags": [
            "astrology",
            "2026 horoscope",
            "LIBRA",
            "mystical",
            "horoscope 2026",
            "platonic compatibility",
            "2026 astrologer",
            "pluto 2026",
            "#shorts",
            "transformation",
            "reading",
            "find Destiny",
            "spirituality",
            "personal growth",
            "career guidance",
            "zodiac horoscope",
            "shorts",
            "viral",
            "libra"
        ]
    },
    {
        "script_text": "As the mystical video director reading your Akaschic Records, it is crystal clear that for Scorpios in 2026, Pluto's move into Aquarius is about to revitalize your career path. This slow-moving giant is on your journey to bring revolutionary changes, almost as if erasing old identities and birthing something entirely new. Neptune’s influence is subtle but powerful, urging deep introspection and spiritual Realization. Embrace hidden truths, for they are the keys to your soul’s next evolution. Understand, this is a time of profound transformation—a perfect cycle for letting go of limitations and embracing power in unexpected spheres. Remain open, for these changes are not random but highly aligned with your true purpose.",
        "title": "SCORPIO 2026: Mystical Revolution & Career Transcendence #Astrology",
        "target": "SCORPIO",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/SCORPIO.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "SCORPIO 2026 Destiny Changes: THINGS CAN’T GET ANY WEIRDER #shorts",
        "youtube_description": "Are you ready for a career overhaul in 2026?\nPluto in Aquarius means new power, new risks, and a total leadership shift.\nWhat will your spiritual awakening bring?\nEngage by telling us your biggest challenge this year.\nDream boldly! \n#SCORPIO #astrology #careertransformation #manifestation",
        "youtube_tags": [
            "#astrology",
            "#SCORPIO",
            "#2026horoscope",
            "#Pluto",
            "#Aquarius",
            "#career",
            "#transformation",
            "#manifestation",
            "#spirituality",
            "#mystical",
            "#newbeginning",
            "#prediction",
            "#motivation",
            "# destiny",
            "#signs",
            "#shorts",
            "shorts",
            "viral",
            "astrology",
            "scorpio"
        ]
    },
    {
        "script_text": "Are you ready to break free from limitations and join a new age revolution? As the slow-moving giants—Pluto, Neptune, and Uranus—shift in perfect alignment with your radiant Sagittarius path, the power of the 10th house transforms overnight. Pluto’s bold entry into Aquarius is about to rewrite your identity, career, and society’s rules. Embrace the mystical cosmic stirrings that 2026 brings—where ancient wisdom meets futuristic journeys. Step into your destiny and become the architect of your own remarkable legacy. Your year of ascension is here—how will you respond to the call of the stars?",
        "title": "2026 Sagittarius: Destiny Awakens",
        "target": "SAGITTARIUS",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/SAGITTARIUS.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "2026 Sagittarius: Cosmic Revolution Surfaces Alert Now #shorts",
        "youtube_description": "Are you ready to become a legendary figure in 2026? Let these mystical cosmic truths shake your life. 🌌 Will your career and spiritual journey change forever? Comment below how you plan to rise above 2026’s cosmic storm. #astrology #SAGITTARIUS #destiny #transits",
        "youtube_tags": [
            " astrology",
            "Sagittarius",
            "2026 horoscope",
            "Pluto Neptune Uranus",
            "career transformation",
            "astrology predictions",
            "spiritual growth",
            "Uranus",
            "Pluto",
            "transits",
            "manifestation",
            "galaxy",
            "spiritual journey",
            "zodiac",
            "#shorts",
            "mystical",
            "shorts",
            "viral",
            "astrology",
            "sagittarius"
        ]
    },
    {
        "script_text": "Are you ready to transform your destiny in 2026? As Pluto, the planet of deep transformation, finally emerges into Aquarius, Capricorn, you’ll witness the rise of a new era in your 10th House — your career, reputation, and future plans will be upended, but reborn with unprecedented power. Jupiter, ruler of expansion, spreads optimism, urging you to seize opportunities with courage and vision. Neptune brings mystery and higher insight, nudging you toward subtler methods for achieving your objectives. Uranus, the harbinger of innovation, ignites moments of creative breakthrough. This cosmic alignment summons the theme of year: embracing radical transformation, grasping opportunities for growth, and accepting change as the catalyst for lasting evolution. The year will challenge you to break free from old formulas—then help you rise into a new, elevated life. Are you embodying the courage to endure and evolve? Tune in to unlock your 2026 destiny.",
        "title": "Capricorn 2026 Destiny: Pluto in Aquarius Revolution!",
        "target": "CAPRICORN",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/CAPRICORN.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Capricorn Hashtag Breakthrough: Pluto & Major Cosmic Changes 2026! #shorts",
        "youtube_description": "Pluto, Neptune, and Uranus align to rewrite your career—how will you transform? Are you ready for 2026’s bold shifts? Tell us your predictions and strategies in the comments! #CAPRICORN #transformations #destiny #astrology",
        "youtube_tags": [
            "#astrology",
            "#theartofpredicting",
            "#2026horoscopes",
            "#capricorn",
            "#MysticReadings",
            "#Pluto",
            "#changeyourlife",
            "#Jupiter",
            "#Neptune",
            "#Uranus",
            "#careertransformation",
            "# spiritualgrowth",
            "#manifestation",
            "#destiny",
            "# spirituality",
            "shorts",
            "viral",
            "astrology",
            "capricorn"
        ]
    },
    {
        "script_text": "AQUARIUS, prepare for a watershed year as Pluto's potent light blazes into your 10th House. Your career institution, reputation, and world vision will shift on a quantum level. Neptune will dissolve boundaries and invite cosmic tinkering with your destiny. Meanwhile, Uranus will crack open portals to revolutionary ideas. You are on the cusp of a seismic transformation—new alliances, ground-breaking work, and access to a higher cosmic network. This is your time to claim your uniqueness and redefine collective progress. Embrace the chaos for it will pave the way for an unprecedented future. May your journey be one of radical empowerment.",
        "title": "2026 AQUARIUS: Pluto, Neptune, Uranus Make Radical Changes!",
        "target": "AQUARIUS",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/AQUARIUS.jpg"
        ],
        "active": true,
        "status": "done",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Aquarius 2026 Revolution: Pluto Shakes Up Your Future #shorts",
        "youtube_description": "Get ready for change! Pluto, Neptune, and Uranus are destined to transform Aquarius in 2026. Will you unlock your true potential? Comment below with your biggest 2026 goals!\n\nAstrology changes daily. Watch more readings, join our community channel for live updates!\n#Astrology #AQUARIUS #Manifestation #Fate",
        "youtube_tags": [
            "#Astrology",
            "#2026Horoscope",
            "#Aquarius",
            "#Tarot",
            "#Zodiac",
            "#Cosmic",
            "#Pluto",
            "#Neptune",
            "#Uranus",
            "#ReadYourDestiny",
            "#Spirituality",
            "#FuturePrediction",
            "#LifeChanges",
            "#CosmicTransformation",
            "#Destiny",
            "#Mystical",
            "#Shorts",
            "#AstrologyShorts",
            "#FutureProphets",
            "#AstrologyNews",
            "shorts",
            "viral",
            "astrology",
            "aquarius"
        ]
    },
    {
        "script_text": "Pisces, the mystical visionaries, prepare for cosmic transformation in 2026. As Pluto moves into Aquarius, your legacy in the 10th House of Career will be revolutionized. This rare transit brings truth, power, and the collective potential to change how you impact the world. Neptune’s shadow speaks of hidden opportunities and spiritual breakthroughs, while Uranus inspires unpredictability and visionary shifts. Embrace unconventional paths, speak truth to power, and remember: this year is about awakening your true self and elevating your soul’s mission. Listen to your intuition—starlight guides your destiny. You are called to become a luminous bridge between past and future, and the Universe awaits your awakening.",
        "title": "Pisces 2026: The Age of Astrological Revolution Begins",
        "target": "PISCES",
        "type": "yearly",
        "images": [
            "assets/zodiac_signs/PISCES.jpg"
        ],
        "active": true,
        "status": "pending",
        "uploaded": false,
        "date": "Jan 16",
        "youtube_title": "Pisces 2026 Horoscope: This IS Your Destiny Transformation! #shorts",
        "youtube_description": "Will the universe change your life in 2026?!\nAre you ready to break free from the past and become a world-shaping visionary?\nWhich chakra is awakening this year? 🪐✨\n#PISCES #Astrology #2026Horoscope #Destiny",
        "youtube_tags": [
            "#PISCES",
            "#Astrology",
            "#2026Horoscope",
            "#AstrologyShorts",
            "#AstrologyPrediction",
            "#CosmicTransformation",
            "#Pluto",
            "#Uranus",
            "#Neptune",
            "# Zodiac",
            "#Manifestation",
            "#CareerChange",
            "#SpiritualAwakening",
            "#FuturePrediction",
            "#Eclipse"
        ]
    }
]